[{"Id":419,"Title":"You Got This","Abstract":"Sometimes when we're stuck in the depths of struggles we forget how powerful we individual humans really are. It's easy to lose sight of our abilities and strengths when we're fighting through difficult relationships, bad work situations, or grief and trauma.\n\nOpening up to facing adversity isn't ever easy, but we can learn to work through challenges we never thought ourselves able to survive.","Room":"Ballroom 3","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":26,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":50,"Text":"Keynote"},{"Id":164,"Text":"Emotional Intelligence"},{"Id":170,"Text":"Learning"}],"Speaker":{"Id":170,"DisplayName":"Jim Holmes"},"TimeSlot":{"StartTime":"2018-10-12T13:30:00","EndTime":"2018-10-12T14:30:00","DisplayDateTime":"Friday, October 12 at 8:30 AM"}},{"Id":319,"Title":"Texas: Virtual DOM library for server-side V-DOM.","Abstract":"Client-side applications are expensive to make, difficult to maintain and practically impossible to account for all edge cases.  We've gotten so caught up in the front-end framework fever that we haven’t yet taken the time to consider if there are better ways to achieve the goal of building rich user interactions.  Texas takes the Virtual DOM approach for updating the DOM with lightweight patches, but instead of calculating patches on the client, it does all the heavy lifting on the server-side bringing control back to the developer and keeping your source of truth closer to your business logic.  The end result is faster initial page loads, less data over the wire, more flexibility in choosing your transport methods, graceful application degradation, and maybe the most attractive feature is the development speed increase you'll see when you come back to the server and stop struggling with client-side code!","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":1,"TimeSlotId":27,"Tags":[{"Id":23,"Text":"Web"},{"Id":46,"Text":"Performance"},{"Id":88,"Text":"elixir"},{"Id":90,"Text":"phoenix"}],"Speaker":{"Id":16,"DisplayName":"Dan McGuire"},"TimeSlot":{"StartTime":"2018-10-12T15:00:00","EndTime":"2018-10-12T16:00:00","DisplayDateTime":"Friday, October 12 at 10:00 AM"}},{"Id":324,"Title":"Developer's Role In SCRUM","Abstract":"SCRUM is overloaded with meetings. In this session we'll look at each meeting in a typical SCRUM Sprint with the developer in mind. We'll start by reviewing the SCRUM process then talk about the individual roles on a team. The majority of the session will focus on the various SCRUM meetings. We'll see how to prepare for the meeting, what to expect in the meeting, and what to do after the meeting.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":2,"TimeSlotId":27,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":6,"Text":"Scrum"},{"Id":8,"Text":"Agile"},{"Id":9,"Text":"Methodology"},{"Id":138,"Text":"Project Management"},{"Id":141,"Text":"Productivity"}],"Speaker":{"Id":122,"DisplayName":"BJ"},"TimeSlot":{"StartTime":"2018-10-12T15:00:00","EndTime":"2018-10-12T16:00:00","DisplayDateTime":"Friday, October 12 at 10:00 AM"}},{"Id":327,"Title":"Rub Some DevOps on Your Node App in Azure","Abstract":"So you decided to use NodeJS to build an API layer for your latest software application but you aren’t quite sure how to do continuous integration or continuous deployment but your team is using [Visual Studio Team Services](https://www.visualstudio.com/team-services/) (VSTS).  Then you should come to this talk and learn the following:\n\n-  How to set up an automated build that is triggered by a check-in to your code repository\n-  How to set up an automated release that is triggered by a build and automatically deployed\n-  How to set up an automated release that is triggered by a build but not automatically deployed someone manually approves it\n-  How you can use more than just the code repositories in VSTS for your builds\n\nBy the end of the talk, you will understand what it looks like to deploy a NodeJS API using VSTS into an Azure Web App.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":27,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":14,"Text":"VSTS"},{"Id":136,"Text":"Node.js"},{"Id":137,"Text":"Cloud"}],"Speaker":{"Id":15,"DisplayName":"Paul Gower"},"TimeSlot":{"StartTime":"2018-10-12T15:00:00","EndTime":"2018-10-12T16:00:00","DisplayDateTime":"Friday, October 12 at 10:00 AM"}},{"Id":313,"Title":"Practical Computer Science: What You Need To Know Without the Degree","Abstract":"Take a look at the developers around you.  What are their backgrounds?  Are they all Computer Scientists?  I’m betting not.  Electrical Engineers, Physics backgrounds, Music degrees, Boot Camps….regardless of where you came from, if you like developing software, you typically don’t have a problem finding a job.  \n\nWhile there is a large debate going on in our community about the necessity of a “Computer Science Degree”, the truth is you can be amazingly successful without one.  However, you can’t dispute that some Computer Science background is useful.  So if you’re background is not in CS, what can you do?\n\nThis talk aims to be a broad introduction to computer science fundamentals such as algorithms, data structures, programming language design, and more, all through practical examples.  You will learn about what a Computer Science Degree typically entails, and why that knowledge is important in your day-to-day work.  At the end of this talk, you will have a grasp of CS core concepts and be able to become more effective as a software developer.\n","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":27,"Tags":[{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":160,"Text":"Computer Science"}],"Speaker":{"Id":66,"DisplayName":"Pat Viafore"},"TimeSlot":{"StartTime":"2018-10-12T15:00:00","EndTime":"2018-10-12T16:00:00","DisplayDateTime":"Friday, October 12 at 10:00 AM"}},{"Id":335,"Title":"SQL Server Performance Tips","Abstract":"You want your SQL Server code to perform better, right? We all write queries that just don't seem to go quite a quickly as we think they should.  We will look at some frequent causes for performance issues and address some common fixes that will improve many problems.  Sometimes SQL Server just doesn't \"think\" the same way that we do, but fortunately some relatively small changes can make a dramatic difference.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":5,"TimeSlotId":27,"Tags":[{"Id":29,"Text":"Database"},{"Id":46,"Text":"Performance"},{"Id":114,"Text":"SQLServer"}],"Speaker":{"Id":93,"DisplayName":"Allison Benneth"},"TimeSlot":{"StartTime":"2018-10-12T15:00:00","EndTime":"2018-10-12T16:00:00","DisplayDateTime":"Friday, October 12 at 10:00 AM"}},{"Id":333,"Title":"You are (not) a fraud","Abstract":"Most people, at some point, feel like they're faking it, and sometimes they are!  Sometimes, though, we're not, and this feeling can become overwhelming and start to be harmful.  Impostor Syndrome is common in the tech industry, and in this talk, we'll examine it, as well as what we can do for ourselves or those around us who struggle.  ","Room":"Ballroom 1","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":28,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":73,"Text":"Mental Health"},{"Id":166,"Text":"Happiness"}],"Speaker":{"Id":125,"DisplayName":"Harold Schreckengost"},"TimeSlot":{"StartTime":"2018-10-12T16:30:00","EndTime":"2018-10-12T17:00:00","DisplayDateTime":"Friday, October 12 at 11:30 AM"}},{"Id":365,"Title":"How much Lambda can we Lambda in 30 minutes?","Abstract":"In this session, I'll attempt to build and deploy an AWS Lambda function and add as many bells and whistles as possible in 30 minutes. I don't like the name \"serverless\" any more than you do, but I think you'll be surprised just how much undifferentiated heavy lifting AWS can do for you on their platform. I'll use Node.js as a language and save my work to Github as I go. No previous experience in any of the related technologies should be required.","Room":"Ballroom 2","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":28,"Tags":[{"Id":63,"Text":"AWS"},{"Id":137,"Text":"Cloud"},{"Id":149,"Text":"Serverless"}],"Speaker":{"Id":156,"DisplayName":"Bryan Robbins"},"TimeSlot":{"StartTime":"2018-10-12T16:30:00","EndTime":"2018-10-12T17:00:00","DisplayDateTime":"Friday, October 12 at 11:30 AM"}},{"Id":352,"Title":"Connecting the Dots: How Angular Components Work Together","Abstract":"Picking up a new framework with a new design paradigm can be daunting. You hear familiar names being tossed around (Components, Libraries, Objects), but they're being used in new and mysterious ways. In this talk we'll cover what some of these pieces are, how they're different, how to use them properly, and, most importantly, how they fit together as pieces of a greater whole. Come see why the Angular way of doing things is awesome (and easy).","Room":"Ballroom 3","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":28,"Tags":[{"Id":37,"Text":"Angular"},{"Id":100,"Text":"typescript"}],"Speaker":{"Id":128,"DisplayName":"Scott McAllister"},"TimeSlot":{"StartTime":"2018-10-12T16:30:00","EndTime":"2018-10-12T17:00:00","DisplayDateTime":"Friday, October 12 at 11:30 AM"}},{"Id":379,"Title":"An only one step ahead guide for machine learning projects","Abstract":"What does a data scientist’s day look like? On the one hand, people say that a data scientist's day is 5% modeling and 95% cleaning data and other stuff. On the other hand, there are many more machine learning tutorials and blog posts on modeling than posts on the \"other stuff\" when I search online. There seems to be a lack of guidance for juniors when they enter into the field who are trying to complete their first few projects. \n\nIn the last few years, I have worked on several data science projects like this, where the path to success was unclear and the journey was full of pitfalls. In this talk, I will provide tips on machine learning projects that I learned the hard way. You will walk away with 2-3 tips for each stage of a machine learning project — tips that would have saved me days when I first started navigating in the muddy data waters.","Room":"Ballroom 4","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":28,"Tags":[{"Id":31,"Text":"Machine Learning"},{"Id":68,"Text":"Data Science"},{"Id":138,"Text":"Project Management"}],"Speaker":{"Id":160,"DisplayName":"Chang Hsin Lee"},"TimeSlot":{"StartTime":"2018-10-12T16:30:00","EndTime":"2018-10-12T17:00:00","DisplayDateTime":"Friday, October 12 at 11:30 AM"}},{"Id":347,"Title":"Who watches the watchmen?   Introducing a better metric of your tests' quality","Abstract":"Tests are watching our code, helping it to not regress.  But who’s watching the watchmen?  Code coverage is often used to determine the quality of automated tests, trying to “test the tests”.  Unfortunately all it does is ensure which lines of code have been executed by the tests, not if they are actually checking anything!  Mutation testing is a way to really watch the watchmen.  Matthew will give an introduction to mutation testing, why it’s better than traditional code coverage, and demo examples using JavaScript and Stryker.","Room":"Ballroom 5","SessionLength":30,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":5,"TimeSlotId":28,"Tags":[{"Id":28,"Text":"Testing"}],"Speaker":{"Id":150,"DisplayName":"Matthew Knowles"},"TimeSlot":{"StartTime":"2018-10-12T16:30:00","EndTime":"2018-10-12T17:00:00","DisplayDateTime":"Friday, October 12 at 11:30 AM"}},{"Id":359,"Title":"Keras -- Baseball Made Easy, Deep Learning made Easier","Abstract":"No sport knows data collection more than the great American pastime, baseball. I will present to the everyday developer an introduction to deep learning and an overview of the tool Keras to demonstrate how to train and optimize neural networks to predict baseball game outcomes (or anything else you have data on). \n\nTraditional machine learning tools can have steep learning curves, dominated by math. Keras is easy to use and a starting point for deep learning and neural networking that grows alongside the user’s abilities into a powerful API to construct highly accurate deep learning models. Come to this session as a novice or a pro, leave the complication at the door, and learn learning, neural networking, and a tool that offers novices the best starting point and pros the fastest prototype time available.\n","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":29,"Tags":[{"Id":152,"Text":"deep learning"},{"Id":153,"Text":"keras"}],"Speaker":{"Id":151,"DisplayName":"Chipper Atkins"},"TimeSlot":{"StartTime":"2018-10-12T18:00:00","EndTime":"2018-10-12T19:00:00","DisplayDateTime":"Friday, October 12 at 1:00 PM"}},{"Id":377,"Title":"The Highs and Woes of Innovation on a Small & Highly Effective Team","Abstract":"Is your organization one of the many that is exploring the best way to introduce innovation and R&D efforts into the mix of yet another crud app and third-party software maintenance projects? Are you part of a large enterprise without a formal structure to support any work that doesn't have concrete deliverables at the end of a predetermined timeline?  So are we.  This is the story of how a handful of developers formed a new team to address multiple business problems and produce exceptional results in unfamiliar territory while clearing both political and technical hurdles and releasing new features in as little as one day.  Along the way, we've established patterns and formed habits that help us achieve exponentially more together than alone, be seamlessly accountable to each other (and the business) and make us excited to come to work to see what we'll accomplish next.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":29,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":51,"Text":"Best Practicies"},{"Id":141,"Text":"Productivity"}],"Speaker":{"Id":117,"DisplayName":"Branden Schwartz"},"TimeSlot":{"StartTime":"2018-10-12T18:00:00","EndTime":"2018-10-12T19:00:00","DisplayDateTime":"Friday, October 12 at 1:00 PM"}},{"Id":353,"Title":"Impress Your Boss by Sitting on Your Ass : Automating Builds and Deployments","Abstract":"I’m lazy and you can be too! Here’s a secret: Automation is simple. It may seem daunting in the beginning but the truth is you already know how to automate the build and deployment of your applications even if you are manually intervening at each step. Why not just do all this work once and be done with it? Let us demystify how to write build and deployment scripts. I’ll walk you through my journey of automating application and database customizations from both human and technical challenges I encountered.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":3,"TimeSlotId":29,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":29,"Text":"Database"},{"Id":41,"Text":"C#"},{"Id":110,"Text":".Net"},{"Id":150,"Text":"Java"}],"Speaker":{"Id":152,"DisplayName":"Dennis Stepp"},"TimeSlot":{"StartTime":"2018-10-12T18:00:00","EndTime":"2018-10-12T19:00:00","DisplayDateTime":"Friday, October 12 at 1:00 PM"}},{"Id":298,"Title":"Dart: What’s in it for You","Abstract":"Multiple apps mean multiple languages right?  It’s just common sense.  The web changed this, but not all for the better.  While the web made availability possible, it’s tough to prevent everything from looking like a web app.  This is where Dart, a recent invention from Google comes in.  Dart started as a new language for web apps that was designed with modern language features like generics, async, classes, modules and type hinting.  It has a complete toolchain that includes debugging and testing so it comes with ‘batteries included’.  It also compiles to JavaScript so it can be used today.  But Dart also targets the server, so you can use the same language for the client and backend and share code between them.  And with Flutter, Dart targets native applications running on iOS, Android and more in the future.  Dart is cross-platform and open source so you don’t have to worry about lock in.  This is more than ‘just another language’.  It’s a development platform which has been future proofed by a technology leader.","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":29,"Tags":[{"Id":122,"Text":"google"},{"Id":154,"Text":"dart"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2018-10-12T18:00:00","EndTime":"2018-10-12T19:00:00","DisplayDateTime":"Friday, October 12 at 1:00 PM"}},{"Id":323,"Title":"The Art of Pair Programming","Abstract":"With the assumption that coding is social, let’s review various pair programming styles so that we can identify when it is best to utilize this approach. This talk starts with an overview of pair programming and why you should consider adding this sill to your tool belt. Next, we will discuss various styles of pairing so that we can see how they can be effectively used during development. Finally, we will discuss a hybrid approach to pair programming that pulls together the best parts of each pairing style to form what I call asynchronous pair programming.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":29,"Tags":[],"Speaker":{"Id":99,"DisplayName":"Todd Merritt"},"TimeSlot":{"StartTime":"2018-10-12T18:00:00","EndTime":"2018-10-12T19:00:00","DisplayDateTime":"Friday, October 12 at 1:00 PM"}},{"Id":375,"Title":"Unit Testing Makes Me Faster: Convincing Your Boss, Your Co-Workers, and Yourself","Abstract":"Bosses hate unit testing. They see it as code that doesn't contribute to the final product. And maybe you see testing that way as well. But here's the truth: unit testing makes us faster. You'll look at specific examples of how unit tests save time in the development process by letting us code more confidently, catch bugs earlier, and minimize manual testing. With this in hand, you can show your boss (and yourself) how unit testing makes us faster.","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":30,"Tags":[{"Id":9,"Text":"Methodology"},{"Id":28,"Text":"Testing"}],"Speaker":{"Id":135,"DisplayName":"Jeremy Clark"},"TimeSlot":{"StartTime":"2018-10-12T19:30:00","EndTime":"2018-10-12T20:30:00","DisplayDateTime":"Friday, October 12 at 2:30 PM"}},{"Id":400,"Title":"No Server no Cry:  Building easily scalable serverless web application in the cloud with AWS","Abstract":"From user management to database storage, managed web services have made building scalable web apps easier than ever.  Out of the box managed services make the entire lifecycle of software development easier for developers of any skill level.  \n\nThis talk will include a live demo of a typical web app, utilizing as many services as we can to make project creation quick and easy.  By utilizing services for user management (Cognito), front end (S3), backend (Lambda) and database storage (Dynamo), we can quickly spin up an elastic, low maintenance, highly decoupled solution on the cheap, paying for only what we use.  We will also cover the high-level points of cloud architecture, including principles such as security and high-availability.\n","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":30,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":54,"Text":"Architecture"},{"Id":63,"Text":"AWS"},{"Id":124,"Text":"INTERNET"},{"Id":137,"Text":"Cloud"}],"Speaker":{"Id":28,"DisplayName":"Chris Smeal"},"TimeSlot":{"StartTime":"2018-10-12T19:30:00","EndTime":"2018-10-12T20:30:00","DisplayDateTime":"Friday, October 12 at 2:30 PM"}},{"Id":401,"Title":"Is This a Button? A Question Your Users Should Never Ask.","Abstract":"Buttons are a primary way people interact with our websites and apps, but recent design trends have caused confusion over what actually is a button and what is static text or imagery. Perhaps you’re in QA and want to increase the quality of an app, a designer looking for usability tips, or a developer who normally thinks nothing more about a button other than instantiating one and placing it in a layout. Either way, learn about ideas you can test to possibly increase your app or website’s usage, guiding people to lead-generation or checkout activities. Topics include color theory, floating buttons, Fitts’s Law, microinteractions, and perceived performance.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":30,"Tags":[{"Id":23,"Text":"Web"},{"Id":43,"Text":"FrontEnd"},{"Id":44,"Text":"Design"},{"Id":59,"Text":"User Experience"},{"Id":60,"Text":"UX"},{"Id":65,"Text":"Mobile"},{"Id":116,"Text":"ios"},{"Id":117,"Text":"android"}],"Speaker":{"Id":94,"DisplayName":"Andrew Malek"},"TimeSlot":{"StartTime":"2018-10-12T19:30:00","EndTime":"2018-10-12T20:30:00","DisplayDateTime":"Friday, October 12 at 2:30 PM"}},{"Id":320,"Title":"Safety and Other Lies We Tell Ourselves","Abstract":"The key role of leaders in Agile organizations is to enable the mindset, values, and principles of Agile to take shape in their teams and organizational culture. This means that leaders must also go through a transformation in which they face the self-deceptions that helped them get where they are but now hinder their ability to support their organization. All transformation efforts are a journey through change whether they be for one person or many. Awareness of one's self-deception offers an opportunity to investigate what is really driving the behaviors that support and undermine the journey.\n\nThis session will investigate the lies we tell ourselves that both help and hinder our individual and organizational success. Participants will be given an opportunity to explicitly identify self-deceptions and identify an action that begins the journey to deeper self-awareness. \n\nLearning Objectives: \nParticipants will be able to\n•Explain the common types of lies we tell ourselves\n•Describe how we benefit from self-deception\n•Recognize accepted group deceptions in organizational cultures\n•Discuss the impacts of deceptive behavior at the individual, team and organization levels\n•Practice bringing self-deception and group deception forward transparently\n•Identify a specific action that can be taken to apply this knowledge in your day to day life","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":4,"TimeSlotId":30,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":8,"Text":"Agile"},{"Id":50,"Text":"Keynote"},{"Id":95,"Text":"Culture"},{"Id":113,"Text":"Conversations"},{"Id":164,"Text":"Emotional Intelligence"}],"Speaker":{"Id":136,"DisplayName":"Jes Katz"},"TimeSlot":{"StartTime":"2018-10-12T19:30:00","EndTime":"2018-10-12T20:30:00","DisplayDateTime":"Friday, October 12 at 2:30 PM"}},{"Id":270,"Title":"Command and Conquer the Front End with Elm","Abstract":"Tired of undefined exceptions in JavaScript?  Heard that JavaScript can be a functional language, but have trouble breaking those imperative habits?  Wanted to learn functional programming, but don't understand the fancy jargon?  Learn to write reliable front end code on the first try with Elm by using the Elm Architecture to control the undefined, unknown, and bad patterns.  Intended for those learning functional programming.  By the end of the session you will have a good understanding of the Elm Architecture and how to integrate Elm into your existing codebase.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":30,"Tags":[{"Id":53,"Text":"Functional Programming"},{"Id":147,"Text":"Elm"}],"Speaker":{"Id":126,"DisplayName":"Tyler Jennings"},"TimeSlot":{"StartTime":"2018-10-12T19:30:00","EndTime":"2018-10-12T20:30:00","DisplayDateTime":"Friday, October 12 at 2:30 PM"}},{"Id":406,"Title":"Becoming an Effective Interviewer","Abstract":"Interviewing is stressful when you’re looking for a job. It's also stressful when (surprise!) you're suddenly the interviewer. You want good team members, but how do you identify them? This talk distills lessons learned from recruiting and managing development teams. It covers the technical and non-technical considerations of identifying your team’s needs and finding the people that fit them. By applying this framework to your own team, you'll be prepared to ask the right questions and know whether candidates will fit your team today and in the future.","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":31,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":35,"Text":"Leadership"},{"Id":57,"Text":"Business"}],"Speaker":{"Id":162,"DisplayName":"Cassandra Faris"},"TimeSlot":{"StartTime":"2018-10-12T21:00:00","EndTime":"2018-10-12T22:00:00","DisplayDateTime":"Friday, October 12 at 4:00 PM"}},{"Id":339,"Title":"Develop your Sense of Code Smell","Abstract":"It has been 18 years since Martin Fowler published “Refactoring” which codified an initial catalog of code smells.  But in that time, have our noses been able to sniff them out?  What have we done to develop our sense of smell?\n\nWe will do a series of Sparrow Decks to increase our sense of code smell by building the pattern recognition part of our brain.  This way we can more easily know if there is something wrong with the code.  Remember smelling you have a problem is always the first step.\n\n(Note: this technique works for non-programmers as well as programmers so even if you’re not a programmer, come and develop your sense of code smell!)\n","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":31,"Tags":[{"Id":24,"Text":"Clean Code"},{"Id":34,"Text":"Personal Growth"},{"Id":165,"Text":"Motivation"},{"Id":170,"Text":"Learning"}],"Speaker":{"Id":147,"DisplayName":"Mike Clement"},"TimeSlot":{"StartTime":"2018-10-12T21:00:00","EndTime":"2018-10-12T22:00:00","DisplayDateTime":"Friday, October 12 at 4:00 PM"}},{"Id":337,"Title":"Decoding Your Health in Polyglot Technology","Abstract":"\nEvery developer wants to be productive and get more things accomplished during their day-to-day work. Given a choice between working harder and working smarter, you will most likely choose the latter. But the big question is “How do you boost your productivity and still keep your health and mental sanity?” The human body is one of the most powerful but mysterious pieces of technical work ever.  How do you keep this marvelous body operating to its’ peer performance and live life to the fullest?  There are basically 8 codes that control the human body’s health and by observing these developers have seen great results in their health and productively.  These 8 codes are like the tip of an ice burg that only reveals the foundation of the ice burg as your follow the code. How do you increase work and keep your health? WELLNESS (Water, Exercise, Love nutritious food, Love the Creator above all, Never partake of that which is harmful to your health and don’t over do the good, Enjoy fresh air, Sleep, Sunshine). In this session, you will learn a number of tips and rules which will enhance health which in turn will help your productively. We will explore ways to stop doing those habits that break the body down leading to a lack of productively and how to replace with the 8 codes that lead to health and good productively.  This will be a content rich session with plenty of live demos. By the end of this session, you will learn some useful techniques to take back with you and apply in your day-to-day work. Many have worked their whole lives at the expense of their health and would spend all their fortune to gain it back.\n","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":31,"Tags":[{"Id":51,"Text":"Best Practicies"},{"Id":131,"Text":"Future"},{"Id":140,"Text":"spark"},{"Id":141,"Text":"Productivity"},{"Id":152,"Text":"deep learning"},{"Id":164,"Text":"Emotional Intelligence"},{"Id":165,"Text":"Motivation"},{"Id":166,"Text":"Happiness"}],"Speaker":{"Id":145,"DisplayName":"Draunta Nicovich"},"TimeSlot":{"StartTime":"2018-10-12T21:00:00","EndTime":"2018-10-12T22:00:00","DisplayDateTime":"Friday, October 12 at 4:00 PM"}},{"Id":409,"Title":"Look Ma, No Servers: AWS Serverless Applications with the .NET Stack","Abstract":"Virtualization has freed most developers from having to interact with the icky bits of heavy metal that run their applications. Now, AWS Lambda has freed us from even having to deal with web servers. This session talks about the ways we need to think differently about serverless applications and demonstrates creating and deploying an entire web application without any servers.\n\nMost .NET-oriented talks about serverless applications focus on Azure. But the bookstore has a great serverless platform too! This session focuses on AWS and the .NET stack.","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":31,"Tags":[{"Id":41,"Text":"C#"},{"Id":63,"Text":"AWS"},{"Id":149,"Text":"Serverless"}],"Speaker":{"Id":164,"DisplayName":"Bryan Slatner"},"TimeSlot":{"StartTime":"2018-10-12T21:00:00","EndTime":"2018-10-12T22:00:00","DisplayDateTime":"Friday, October 12 at 4:00 PM"}},{"Id":302,"Title":"An Introduction to Server Configuration and Provisioning with Ansible","Abstract":"Some applications and environments just don't fit well into a web app or a Docker container, and not everyone is in the cloud. Most everyone has some on-premise servers and a multitude of virtual machines. Managing all of those servers is difficult and usually involves extensive use of un-documented tribal knowledge to set these servers up or to duplicate these servers for another environment. Ansible automates away these tasks of setting up a server.\n\nAnsible simplifies server provisioning, preparing the server for use, by allowing tasks to be scripted and source controlled. Server configuration is also kept in source control and encrypted. These Ansible scripts, or \"playbooks\", not only automate server setup, they now become the documentation of that server.\n\nIn this session, I will give an introduction of Ansible from the ground up and each topic will show its effects on a server.\n\nNo prior knowledge about Ansible is assumed. You will walk away with an understanding of how to do basic tasks with Ansible and when to use Ansible.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":31,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":84,"Text":"Backend"},{"Id":143,"Text":"Automation"},{"Id":156,"Text":"Ansible"},{"Id":157,"Text":"Infrastructure As Code"}],"Speaker":{"Id":134,"DisplayName":"Daniel Oliver"},"TimeSlot":{"StartTime":"2018-10-12T21:00:00","EndTime":"2018-10-12T22:00:00","DisplayDateTime":"Friday, October 12 at 4:00 PM"}},{"Id":275,"Title":"Serverless: Bootstrap Globally in Minutes for Pennies","Abstract":"If you have ever been interested in what it takes to build and operate a “serverless” architecture in the cloud, this talk is for you.  Serverless offers a lot of interesting advantages, such as a simplified delivery model.  I will walk through creating a globally distributed serverless application in AWS.\n\nAfter attending this session, you will have a roadmap to bootstrap your ideas globally in minutes for pennies.  Templates and patterns will be provided so that somebody with basic familiarity with AWS, Javascript, and a bit of simple Python can have their own serverless site up and running by the end of the day.","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":1,"TimeSlotId":32,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":23,"Text":"Web"},{"Id":54,"Text":"Architecture"},{"Id":63,"Text":"AWS"},{"Id":149,"Text":"Serverless"}],"Speaker":{"Id":127,"DisplayName":"Andy Cowell"},"TimeSlot":{"StartTime":"2018-10-13T13:30:00","EndTime":"2018-10-13T14:30:00","DisplayDateTime":"Saturday, October 13 at 8:30 AM"}},{"Id":326,"Title":"Bigger Profits with Kanban","Abstract":"You are familiar with Kanban enough to know that it could help your team work smarter, communicate better and produce higher quality work. However, your boss and upper management aren’t ready to allow your team to do it. You need to know how to talk to management in terms they understand so they can fully understand the value of Kanban. Come to this session where I’ll help you communicate the value of Kanban in a way that makes sense to management. I’ll show you how to make a persuasive pitch for Kanban that your leadership can’t refuse.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":32,"Tags":[{"Id":7,"Text":"Kanban"},{"Id":8,"Text":"Agile"}],"Speaker":{"Id":15,"DisplayName":"Paul Gower"},"TimeSlot":{"StartTime":"2018-10-13T13:30:00","EndTime":"2018-10-13T14:30:00","DisplayDateTime":"Saturday, October 13 at 8:30 AM"}},{"Id":350,"Title":"Why Loop in JavaScript When You Can Map, Reduce or Filter?","Abstract":"Traditionally, when developers see large arrays of data their \"go to\" tool for parsing and searching has been the for loop. But JavaScript provides a more declarative approach that can help you find what you're looking for in fewer lines of code that is cleaner, easier to read, and maintain. Come see how the map(), reduce(), and filter() functions can help you!","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":3,"TimeSlotId":32,"Tags":[{"Id":23,"Text":"Web"},{"Id":24,"Text":"Clean Code"},{"Id":53,"Text":"Functional Programming"},{"Id":99,"Text":"javascript"},{"Id":136,"Text":"Node.js"}],"Speaker":{"Id":128,"DisplayName":"Scott McAllister"},"TimeSlot":{"StartTime":"2018-10-13T13:30:00","EndTime":"2018-10-13T14:30:00","DisplayDateTime":"Saturday, October 13 at 8:30 AM"}},{"Id":336,"Title":"SQL Server Game Show - Developer Edition","Abstract":"Who says learning can't be fun?  Test your knowledge of SQL Server development and compete against your fellow attendees.  In the process, we'll pause and discuss how to write better queries that perform.","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":4,"TimeSlotId":32,"Tags":[{"Id":29,"Text":"Database"},{"Id":114,"Text":"SQLServer"},{"Id":169,"Text":"Games"}],"Speaker":{"Id":93,"DisplayName":"Allison Benneth"},"TimeSlot":{"StartTime":"2018-10-13T13:30:00","EndTime":"2018-10-13T14:30:00","DisplayDateTime":"Saturday, October 13 at 8:30 AM"}},{"Id":345,"Title":"Building a simple blockchain using Python","Abstract":"\"Blockchain\" is one of the biggest buzzwords in the tech industry in the past year. But it can be hard to get past all the noise of Bitcoin price predictions, Reddit flame wars, and phishing attacks to actually figure out how the technology behind all of this really works. Python is a great language for learning new concepts because of it's readability. In this talk, Brian will build a very simple blockchain using Python to show how the tech behind all the hype really works and the benefits it has for things other than weird Internet money. Consensus mechanisms, decentralized governance, smart contracts, and much more will be shown in simple, easy-to-read code.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":32,"Tags":[{"Id":67,"Text":"Python"},{"Id":145,"Text":"blockchain"}],"Speaker":{"Id":148,"DisplayName":"Brian Wentzloff"},"TimeSlot":{"StartTime":"2018-10-13T13:30:00","EndTime":"2018-10-13T14:30:00","DisplayDateTime":"Saturday, October 13 at 8:30 AM"}},{"Id":416,"Title":"7 Habits of Highly Paid Developers","Abstract":"Software and website developers are in extremely high demand and rates continue to climb, but many developers have not yet realized their potential. Being good at what you do is important, but it’s equally important that you can communicate the value you bring to an organization and build a reputation that will provide opportunities for growth, both professionally and financially. We will work together to measure your accomplishments, establish a personal brand, and walk away with a resume that conveys your true value!","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":1,"TimeSlotId":33,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"}],"Speaker":{"Id":36,"DisplayName":"Gaines Kergosien"},"TimeSlot":{"StartTime":"2018-10-13T15:00:00","EndTime":"2018-10-13T16:00:00","DisplayDateTime":"Saturday, October 13 at 10:00 AM"}},{"Id":410,"Title":"From I-Don't-Know-Crap-About-Linux to Running ASP.NET Core in 60 minutes","Abstract":"Long-time Windows developers and .NETters may be feeling a little bit of unease now that their favorite tools and platforms are moving beyond Windows. The best way to learn any new technology is to just jump right in and get started. But the choices are often paralyzing if you don't know where to start.\n\nIf you're looking at Linux for any reason, but you're overwhelmed by all the tools and technologies, then this is the talk for you. We'll start from a brand-new Ubuntu installation and by the time we're done we'll have a working ASP.NET Core application deployed and running in a container. We'll also completely automate the build and deployment procedure. You'll be able to use the code from the session to help jump start your own projects.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":33,"Tags":[{"Id":126,"Text":"ASP.NET Core"}],"Speaker":{"Id":164,"DisplayName":"Bryan Slatner"},"TimeSlot":{"StartTime":"2018-10-13T15:00:00","EndTime":"2018-10-13T16:00:00","DisplayDateTime":"Saturday, October 13 at 10:00 AM"}},{"Id":369,"Title":"Build a Machine Learning Supercomputer under $500","Abstract":"Hardware has become so cheap these days that we can take the processing power of several small computers, Raspberry Pi’s in this case, and build them into a cluster computer to build a purpose built computer for handling machine learning problems. The beauty part is that you can configure the cluster to your exact problem you are solving instead of trying to wedge into existing hardware structures.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":33,"Tags":[{"Id":19,"Text":"Hardware"},{"Id":22,"Text":"Raspberry Pi"},{"Id":31,"Text":"Machine Learning"},{"Id":139,"Text":"tensorflow"},{"Id":152,"Text":"deep learning"}],"Speaker":{"Id":158,"DisplayName":"Brian Korzynski"},"TimeSlot":{"StartTime":"2018-10-13T15:00:00","EndTime":"2018-10-13T16:00:00","DisplayDateTime":"Saturday, October 13 at 10:00 AM"}},{"Id":269,"Title":"Write Cleaner JavaScript Today","Abstract":"JavaScript is being utilized for everything now days.  As Atwood's Law states,  \"Any application that can be written in JavaScript, will eventually be written in JavaScript.\".  This is because JavaScript is a very easy language to pick up and learn.  After all, anyone can open any browser's dev tools and start coding in JavaScript and watch it immediately run.  However, it is also very easy to create a mess with JavaScript.  Neat code can easily turn into spaghetti code that is hard to understand. Worse, it can contain all sorts of hidden bugs until runtime.  Let us take a look at some language features and techniques that can help clean up our code, make it easier to read, and eliminate bugs.  ","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":4,"TimeSlotId":33,"Tags":[{"Id":56,"Text":"Patterns"},{"Id":99,"Text":"javascript"}],"Speaker":{"Id":126,"DisplayName":"Tyler Jennings"},"TimeSlot":{"StartTime":"2018-10-13T15:00:00","EndTime":"2018-10-13T16:00:00","DisplayDateTime":"Saturday, October 13 at 10:00 AM"}},{"Id":412,"Title":"Going Fast: The Art of Delivering Quality Software Quickly","Abstract":"Building software is tricky business and the demands are higher than ever. Agile was meant to free us from the confines of red-tape driven software, but most of us can't help but feel something is off in our software process.\n\nDo you wonder why startups can launch an entire product in a few months, but it took your team 6 months to get that new feature into production?\n\nDo you get tired of having hour long meetings with 16 people just to talk about having another meeting to talk about the color of a button to use?\n\nAre you stuck building a bunch of features \"just in case\" instead of getting something working in front of a user?\n\nDoes it take you more time to plan, document and release a simple change than it does to actually make the change?\n\nIf any of these resonate with you, then come learn about a simple question you, your team, and your company can ask yourselves that will help you cut through the bloat in your software process, and start delivering value like never before.\n","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":33,"Tags":[{"Id":8,"Text":"Agile"},{"Id":9,"Text":"Methodology"},{"Id":13,"Text":"DevOps"},{"Id":141,"Text":"Productivity"},{"Id":143,"Text":"Automation"},{"Id":185,"Text":"Continuous Improvement"}],"Speaker":{"Id":74,"DisplayName":"Josh"},"TimeSlot":{"StartTime":"2018-10-13T15:00:00","EndTime":"2018-10-13T16:00:00","DisplayDateTime":"Saturday, October 13 at 10:00 AM"}},{"Id":414,"Title":"A Small Piece: Breaking Out Parts of Your Application for the Future","Abstract":"We hear a lot about microservices and their benefits now, but what if switching to a full microservices architecture isn't feasible?  What if your application is so tightly integrated that rearchitecting it to use anything other than what it uses is a daunting task?\n\nCome learn how to make and keep your application maintainable when you're building on a legacy base, based on a simple idea - pick someplace and start there.","Room":"Ballroom 1","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":34,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":27,"Text":"Operational Insights"},{"Id":63,"Text":"AWS"},{"Id":137,"Text":"Cloud"},{"Id":156,"Text":"Ansible"},{"Id":157,"Text":"Infrastructure As Code"}],"Speaker":{"Id":125,"DisplayName":"Harold Schreckengost"},"TimeSlot":{"StartTime":"2018-10-13T16:30:00","EndTime":"2018-10-13T17:00:00","DisplayDateTime":"Saturday, October 13 at 11:30 AM"}},{"Id":398,"Title":"3D Printing for Beginners","Abstract":"Have you thought that 3D printing looks or sounds cool, but you have no idea where to start? Maybe you don't know how to pick a printer, or don't know what you can make? We'll go over everything that's needed to get you making your first print and help you narrow down which kind of printer and modeling software is for you.","Room":"Ballroom 2","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":34,"Tags":[{"Id":19,"Text":"Hardware"},{"Id":183,"Text":"3D Printing"},{"Id":184,"Text":"3D Modeling"}],"Speaker":{"Id":53,"DisplayName":"Charlotte M. Ellett"},"TimeSlot":{"StartTime":"2018-10-13T16:30:00","EndTime":"2018-10-13T17:00:00","DisplayDateTime":"Saturday, October 13 at 11:30 AM"}},{"Id":397,"Title":"The Trivial History of Computer Games","Abstract":"Over the decades, video games have helped push computer technology forward.  Learn about past advances in both game design and game technology in this fun trivia panel.","Room":"Ballroom 3","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":34,"Tags":[{"Id":169,"Text":"Games"},{"Id":181,"Text":"History"},{"Id":182,"Text":"Interactive"}],"Speaker":{"Id":161,"DisplayName":"Jesse W. Schirmer"},"TimeSlot":{"StartTime":"2018-10-13T16:30:00","EndTime":"2018-10-13T17:00:00","DisplayDateTime":"Saturday, October 13 at 11:30 AM"}},{"Id":364,"Title":"Practical CD: Naming and Taming Your Delivery Pipeline","Abstract":"At first, the claims of so-called \"continuous delivery\" seem dubious. Do we really think that releasing more often can increase quality? Even if it can, is it worth the overhead? In this session, I'll share my experiences and techniques in clarifying and optimizing delivery pipelines for Web applications. Though I'll draw from my experiences running Web applications on the cloud, I'll be framing my takes in a platform and domain-neutral way.","Room":"Ballroom 4","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":34,"Tags":[{"Id":142,"Text":"Continual Integration"},{"Id":143,"Text":"Automation"}],"Speaker":{"Id":156,"DisplayName":"Bryan Robbins"},"TimeSlot":{"StartTime":"2018-10-13T16:30:00","EndTime":"2018-10-13T17:00:00","DisplayDateTime":"Saturday, October 13 at 11:30 AM"}},{"Id":322,"Title":"Be Your Best (Developer) Self","Abstract":"Do you love your job? Do you feel productive and powerful as a technologist? Are your contributions valued, and do you feel they make a difference? If not, you may not be living your best developer life. In this session, we'll talk about ways to challenge the status quo, break through mental barriers, and create the job situation you want, no matter where you are.","Room":"Ballroom 5","SessionLength":30,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":5,"TimeSlotId":34,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":35,"Text":"Leadership"},{"Id":141,"Text":"Productivity"},{"Id":165,"Text":"Motivation"},{"Id":166,"Text":"Happiness"}],"Speaker":{"Id":137,"DisplayName":"Kevin P. Davis (kpd)"},"TimeSlot":{"StartTime":"2018-10-13T16:30:00","EndTime":"2018-10-13T17:00:00","DisplayDateTime":"Saturday, October 13 at 11:30 AM"}},{"Id":374,"Title":"Clean Code: Homicidal Maniacs Read Code, Too!","Abstract":"There's no such thing as a write-once application. The world is constantly changing, and our code needs to change with it. We'll think in small pieces and take a look at some principles and techniques that will keep our code manageable and understandable. Think about the developer who will come after you. Now, imagine that he's a homicidal maniac who knows where you live.","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":35,"Tags":[{"Id":24,"Text":"Clean Code"}],"Speaker":{"Id":135,"DisplayName":"Jeremy Clark"},"TimeSlot":{"StartTime":"2018-10-13T18:00:00","EndTime":"2018-10-13T19:00:00","DisplayDateTime":"Saturday, October 13 at 1:00 PM"}},{"Id":405,"Title":"Health: The Most Important Tech Tool","Abstract":"Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, more productive person.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":35,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":73,"Text":"Mental Health"},{"Id":166,"Text":"Happiness"}],"Speaker":{"Id":162,"DisplayName":"Cassandra Faris"},"TimeSlot":{"StartTime":"2018-10-13T18:00:00","EndTime":"2018-10-13T19:00:00","DisplayDateTime":"Saturday, October 13 at 1:00 PM"}},{"Id":328,"Title":"Controlling Raspberry Pis with Your Phone using Python","Abstract":"Alexa, Siri, Google… We live in a world where we are increasingly becoming more connected to digital assistants and our own homes.  Home automation is growing like crazy, and it can be daunting to know where to start.  Wouldn’t it be nice if you could start with something simple and not have to get bogged down with a whole bunch of details.\n\nLet’s talk about a Python package called Remote Control For Computers, or RCFC for short.  RCFC let’s you decorate Python functions so that a phone app can call those functions with ease.  To show just how easy it is, we’ll even play around with a live demo!\n\nThen, we’ll delve into the design of the project, and walk through how to create your own similar project, from inception to deployment.   This talk will try and impart lessons learned throughout the development of RCFC.  If you ever wanted to learn a little about Raspberry Pis, GPIO, circuits, python packages, and/or phone development, then this is the talk for you.\n","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":3,"TimeSlotId":35,"Tags":[{"Id":22,"Text":"Raspberry Pi"},{"Id":67,"Text":"Python"},{"Id":143,"Text":"Automation"}],"Speaker":{"Id":66,"DisplayName":"Pat Viafore"},"TimeSlot":{"StartTime":"2018-10-13T18:00:00","EndTime":"2018-10-13T19:00:00","DisplayDateTime":"Saturday, October 13 at 1:00 PM"}},{"Id":386,"Title":"Sniffing USB Packets to Reverse Engineer","Abstract":"Ever want to do something with a piece of hardware that the default software just won't allow you to do?  Learn how to see the data being sent to the hardware and how to send your own data in order to take control.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":5,"TimeSlotId":35,"Tags":[{"Id":19,"Text":"Hardware"},{"Id":178,"Text":"Hacking"}],"Speaker":{"Id":161,"DisplayName":"Jesse W. Schirmer"},"TimeSlot":{"StartTime":"2018-10-13T18:00:00","EndTime":"2018-10-13T19:00:00","DisplayDateTime":"Saturday, October 13 at 1:00 PM"}},{"Id":282,"Title":"Recruiters Suck. Use them.","Abstract":"In today’s tech market there are more recruiters than JavaScript libraries. And just like JavaScript libraries, it’s hard to pick a good recruiter that that won’t burn out in 6 months. In this open forum talk, I will be answering any and all questions you have always wanted to ask us. Like how do we price positions? What do I look for when working with a recruiter? I will also give tips to everyone like how to write a good resume, are cover letters still relevant, how do I approach a job hunt, and what can make you the most attractive as a candidate in the interview process. This talk is geared for the recent software school grad to the Architect who has recently found themselves back on the job market. I look forward to answering all your questions!","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":36,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"}],"Speaker":{"Id":130,"DisplayName":"Taylor Desseyn"},"TimeSlot":{"StartTime":"2018-10-13T19:30:00","EndTime":"2018-10-13T20:30:00","DisplayDateTime":"Saturday, October 13 at 2:30 PM"}},{"Id":420,"Title":"Automated Testing: Beyond The Basics","Abstract":"You've been through some initial training or bootstrapping. Now you're three to six months down the road and you're finding a lot of time is being spent chasing intermittent test failures. You're spending a lot of time maintaining your codebase. You're spending a lot of time dealing with frustration and trust in the automated tests. What's you're not doing is adding a lot of value around new feature work.\r\n\r\nSound familiar? It's a pattern that's common across nearly every team that is new to building significant automation suites. Jim Holmes helps you find a few approaches that may save your sanity—all based on years of experience and hard knocks.\r\n\r\nThis isn't a WebDriver 101 session; we won't be covering basics like waits, find logic, or basic page objects. Instead, we'll dive in to solving problems using software craftsmanship principles, custom-designed APIs, and approaches like Selenium Grid to help you scale out your test suites via parallel execution. You'll leave the session with practical tips to apply to your own testing.\r\n\r\nKey Takeaways\r\n*Avoid overlap of unit, integration, and functional tests\r\n*Test code is production code. Treat it as such.\r\n*Build custom APIs wrapping system APIs to facilitate testing\r\n*Parallelization is a last step for speed, not the first","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":2,"TimeSlotId":36,"Tags":[{"Id":28,"Text":"Testing"}],"Speaker":{"Id":170,"DisplayName":"Jim Holmes"},"TimeSlot":{"StartTime":"2018-10-13T19:30:00","EndTime":"2018-10-13T20:30:00","DisplayDateTime":"Saturday, October 13 at 2:30 PM"}},{"Id":399,"Title":"VR Games in Unreal","Abstract":"Getting into VR development may be easier than you think. We'll go over how to create your first project in the Unreal framework and make it ready to play on platforms such as Oculus Rift.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":36,"Tags":[{"Id":97,"Text":"GameDev"},{"Id":98,"Text":"Unity"},{"Id":105,"Text":"virtual reality"}],"Speaker":{"Id":53,"DisplayName":"Charlotte M. Ellett"},"TimeSlot":{"StartTime":"2018-10-13T19:30:00","EndTime":"2018-10-13T20:30:00","DisplayDateTime":"Saturday, October 13 at 2:30 PM"}},{"Id":362,"Title":"IoT in Azure - A Journey to Production","Abstract":"Microsoft Azure offers a lot of services for building cloud solutions.  So many in fact, that choosing the right tool for the job at times can be difficult.  Other times, the selected service may seem right at first, but turns out to not work once you dig in a little further.  So many online demos are overly simplified, this project was anything but.\n \nThis session this session you'll see:\n\t• Where we started and why we needed/wanted Azure\n\t• PaaS offerings selected and rejected and why\n\t• Difficulties we encountered and how we resolved them\n\t• Future thoughts on things implemented, or yet to come\n \nAlthough this particular solution is IoT, there are only a couple of services selected that are specific to IoT.  So, other than those couple of services, the rest of discussion could apply to anything you wanted to put in the Cloud.\n\n\n","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":4,"TimeSlotId":36,"Tags":[{"Id":17,"Text":"Azure"},{"Id":20,"Text":"IoT"},{"Id":54,"Text":"Architecture"}],"Speaker":{"Id":155,"DisplayName":"Al Zaudtke"},"TimeSlot":{"StartTime":"2018-10-13T19:30:00","EndTime":"2018-10-13T20:30:00","DisplayDateTime":"Saturday, October 13 at 2:30 PM"}},{"Id":300,"Title":"Silver bullets kill werewolves: A contrarian view of software success","Abstract":"This talk is not sexy. In it, you will not learn how to babysit your toddler with IoT, entertain your circus troupe using Alexa, send a rocket to space with microservices, or automate your Prius using functional programming. Instead, you will learn why silver bullets most often fail and how you can make great money and success by avoid the silver bullet trap. \n\nTaken from years of experience as a professional IT consultant, and multiple clients, this session focuses on bucking current trends and concentrating on things that really work. In this session, you will learn:\n\n• Proper organization is better than microservices\n• Acceptability is better than code coverage\n• Strangulation is a great method for software homicide\n• Shift left, and other coding dance moves to increase ROI\n• The power of automation and feedback loops\n","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":5,"TimeSlotId":36,"Tags":[{"Id":24,"Text":"Clean Code"},{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"}],"Speaker":{"Id":35,"DisplayName":"Gregory A. Beamer"},"TimeSlot":{"StartTime":"2018-10-13T19:30:00","EndTime":"2018-10-13T20:30:00","DisplayDateTime":"Saturday, October 13 at 2:30 PM"}},{"Id":292,"Title":"Microsoft Azure Makes Machine Learning Affordable and Accessible","Abstract":"It’s one of the hottest topics in software development that is not a buzzword.  It’s for real.  It’s also really tough.  So how can anyone who needs machine learning get started?  That’s where Microsoft Azure comes in.  Offering a collections of tools that you can get started with for free, Azure makes it possible to perform machine learning tasks with little or no code involved.  Microsoft Azure Machine Learning Studio and Workbench give novices and seasoned users a complete toolchain and workflow for a wide variety of machine learning projects.  From data ingestion to operationalization via web services, developers and data professionals can leverage the power of predictive engines without a Ph.D.  And since it’s opinion-free, supporting current and open source technologies such as Python, R and TensorFlow, you can integrate Azure ML with existing projects.  In addition to the free starter tiers, it’s cost effective when you are ready to upgrade because everything is in the Azure cloud and pay for what you use.  And you might not need to build anything at all.  Azure Cognitive Services provides APIs that let you integrate vision, speech recognition into your app, today!  Why buy a supercomputer when you can rent one?  You don’t need a data center or a staff of eggheads, just Azure Machine Learning.","Room":"Ballroom 1","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":1,"TimeSlotId":37,"Tags":[{"Id":17,"Text":"Azure"},{"Id":31,"Text":"Machine Learning"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2018-10-13T21:00:00","EndTime":"2018-10-13T22:00:00","DisplayDateTime":"Saturday, October 13 at 4:00 PM"}},{"Id":311,"Title":"How Functional Programming Made Me a Better Developer","Abstract":"With the rise in popularity recently, functional programming has become “The Next Big Thing”. As of today, there are tons of frameworks and tools that can be used for front-end, back-end, desktop, and mobile development. With that being said, the majority of us are still using object-oriented languages for our day jobs and don’t need to learn functional programming, right?\n\nIn this talk, I’ll walk you through my experiences learning functional programming over the last year, how my style of programming has changed, and how I now think about programming with regards to both functional and object-oriented paradigms.","Room":"Ballroom 2","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":2,"TimeSlotId":37,"Tags":[{"Id":41,"Text":"C#"},{"Id":52,"Text":"F#"},{"Id":53,"Text":"Functional Programming"}],"Speaker":{"Id":45,"DisplayName":"Cameron Presley"},"TimeSlot":{"StartTime":"2018-10-13T21:00:00","EndTime":"2018-10-13T22:00:00","DisplayDateTime":"Saturday, October 13 at 4:00 PM"}},{"Id":285,"Title":"How to be a Leader","Abstract":"What is leadership?  That term gets thrown around a lot, but what is it really?  What do leader do that makes them leaders?  Leadership can be learned and that is good as leaders are in high demand and in short supply.  TO be an effective leader, you must first understand what leadership is and what traits a leader exhibits.\n\nDuring this session, we will review leadership traits and principles and how you can implement them within your teams.  By demonstrating these in your daily activities you will earn the respect, confidence, and loyal cooperation of those on your team.","Room":"Ballroom 3","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":3,"TimeSlotId":37,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"}],"Speaker":{"Id":132,"DisplayName":"Chad Green"},"TimeSlot":{"StartTime":"2018-10-13T21:00:00","EndTime":"2018-10-13T22:00:00","DisplayDateTime":"Saturday, October 13 at 4:00 PM"}},{"Id":343,"Title":"Software Craftsmanship and Agile Code Games","Abstract":"Musicians and athletes spend most of their time practicing, not performing.  As software developers if we only practice and learn on the job, then we will continue to make mistakes on code meant for customers.  On the job, we can only deliver features as fast as the code base and our skills allow us.  We must improve the quality of our skills which will in turn improve the quality of our code base.  We must take the time to practice allowing ourselves to improve our skills and develop better “code sense”.  Learn how the Software Craftsmanship Manifesto (http://manifesto.softwarecraftsmanship.org/) provides a framework for us to improve in our craft. By learning a variety of code games we can collect a full toolbelt of activities that will help us improve as individuals.  We can then take these games and give others the opportunity to improve and raise the level of the whole community.  We’ll take a whirlwind tour of some different agile code games that will help us improve our craft.\n","Room":"Ballroom 4","SessionLength":60,"EventId":2018,"Level":{"Id":1,"Text":"Beginner"},"RoomId":4,"TimeSlotId":37,"Tags":[{"Id":10,"Text":"TDD"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":44,"Text":"Design"},{"Id":169,"Text":"Games"},{"Id":170,"Text":"Learning"}],"Speaker":{"Id":147,"DisplayName":"Mike Clement"},"TimeSlot":{"StartTime":"2018-10-13T21:00:00","EndTime":"2018-10-13T22:00:00","DisplayDateTime":"Saturday, October 13 at 4:00 PM"}},{"Id":360,"Title":"Writing End-To-End Tests Using Headless Chrome and Puppeteer","Abstract":"End-to-end tests are great! They ensure a great experience for your users, prevent bugs, and save money. However, they also have a history of being brittle and slow... but not any more! In this talk we'll cover end-to-end testing conceptually, then use Headless Chrome and Puppeteer to write powerful tests that can run on top of any stack.","Room":"Ballroom 5","SessionLength":60,"EventId":2018,"Level":{"Id":2,"Text":"Intermediate"},"RoomId":5,"TimeSlotId":37,"Tags":[{"Id":28,"Text":"Testing"},{"Id":99,"Text":"javascript"},{"Id":136,"Text":"Node.js"},{"Id":143,"Text":"Automation"},{"Id":171,"Text":"Headless Browsing"}],"Speaker":{"Id":154,"DisplayName":"Taylor Krusen"},"TimeSlot":{"StartTime":"2018-10-13T21:00:00","EndTime":"2018-10-13T22:00:00","DisplayDateTime":"Saturday, October 13 at 4:00 PM"}}]