[{"Id":47,"Title":"Stronger Than Fear: Mental Health in the Developer Community","Abstract":"There is a crisis in the tech industry. At least 20% of our colleagues, friends, and teammates suffer silently with mental illness, but our work culture does little to help. Based on real data, we'll show the enormous impact of mental illness in our industry, and how we can change – and save – lives.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"},{"Id":36,"Text":"Life Hacks"},{"Id":50,"Text":"Keynote"}],"Speaker":{"Id":44,"DisplayName":"Ed Finkler"},"TimeSlot":{"StartTime":"2016-10-14T13:00:00","EndTime":"2016-10-14T14:30:00","DisplayDateTime":"Friday, October 14 at 8:00 AM"}},{"Id":4,"Title":"Scrum is Agile; Agile is NOT Scrum","Abstract":"Agile is a major buzzword in the development industry.  However, most of the time when we hear the word Agile, we envision Scrum.  I will be reviewing with you the definition of Agile and why Agile is larger than Scrum.  Many of you are probably in an environment that is considered \"Wagile\" or a waterfall and agile mix.  I want to challenge you to investigate whether this is actually true.  Are you really \"wagile\" or are you Agile with a mix of agile implementations?  Come join me as we investigate the core of Agile and some common environments that don't follow a common Scrum implementation.","Room":"Ballroom 1","Tags":[],"Speaker":{"Id":7,"DisplayName":"Heather Tooill"},"TimeSlot":{"StartTime":"2016-10-14T14:45:00","EndTime":"2016-10-14T15:45:00","DisplayDateTime":"Friday, October 14 at 9:45 AM"}},{"Id":5,"Title":"TDD: A Pragmatic Approach","Abstract":"Unit Testing can be mysterious endeavor with a high bar for entry. It doesn't have to be that complicated. Many examples on the Internet show you how to write a Unit Test, but not how to test an entire application. We'll discuss the fundamentals of TDD, how to approach an entire application, how to separate logical layers, and how to test the boundaries.","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":10,"Text":"TDD"},{"Id":24,"Text":"Clean Code"},{"Id":28,"Text":"Testing"},{"Id":41,"Text":"C#"},{"Id":51,"Text":"Best Practicies"}],"Speaker":{"Id":8,"DisplayName":"John Callaway"},"TimeSlot":{"StartTime":"2016-10-14T14:45:00","EndTime":"2016-10-14T15:45:00","DisplayDateTime":"Friday, October 14 at 9:45 AM"}},{"Id":11,"Title":"A History of Cryptography","Abstract":"Over the past fews years we've seen a trend of information security and cryptography become popular in the news. Here, we are going to learn a bit about the history of cryptography, what it does, and how its changed over the years. This evolution of cryptography has brought some polarizing opinions on its use. We'll explore what these changes are, and how they impact science, politics, and societies.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":12,"Text":"Security"},{"Id":15,"Text":"Cryptography"}],"Speaker":{"Id":9,"DisplayName":"Kevin Jones"},"TimeSlot":{"StartTime":"2016-10-14T14:45:00","EndTime":"2016-10-14T15:45:00","DisplayDateTime":"Friday, October 14 at 9:45 AM"}},{"Id":28,"Title":"Empower Any Application with Azure Machine Learning","Abstract":"Integrating Azure Machine Learning features into existing applications and processes by simply calling REST services.\n\nYou will learn :\n1. Learn various ways to abstract business rules, workflows, AI (Machine Learning) and more into your applications\n2. How to Integrate Azure Machine Learning into your existing Applications and Processes\n3. Creating an Azure Machine Learning Experiment\n4. Retrieving the Score from an Azure Machine Learning Experiment and integrating it into your applications and processes\n5. Integrating numerous Machine Learning Experiments from the Azure Machine Learning Marketplace into your existing applications and processes\n6. Learn various concepts for abstracting and managing services and api's.","Room":"Ballroom 4","Tags":[{"Id":1,"Text":"Beginner"},{"Id":17,"Text":"Azure"},{"Id":18,"Text":"Visual Studio"},{"Id":23,"Text":"Web"},{"Id":30,"Text":"AI"},{"Id":31,"Text":"Machine Learning"}],"Speaker":{"Id":21,"DisplayName":"David Walker"},"TimeSlot":{"StartTime":"2016-10-14T14:45:00","EndTime":"2016-10-14T15:45:00","DisplayDateTime":"Friday, October 14 at 9:45 AM"}},{"Id":15,"Title":"Introducing ASP.NET Core: From the Ground Up","Abstract":"Microsoft is re-inventing ASP.NET to embrace open-source and the web community.  In this talk, Shawn Wildermuth will walk you through an empty project to serving MVC6 pages. While he shows you the nuts and bolts, he’ll explain the reason why ASP.NET Core is a completely re-write of the platform.","Room":"Ballroom 1","Tags":[{"Id":1,"Text":"Beginner"},{"Id":18,"Text":"Visual Studio"},{"Id":23,"Text":"Web"}],"Speaker":{"Id":13,"DisplayName":"Shawn Wildermuth"},"TimeSlot":{"StartTime":"2016-10-14T16:15:00","EndTime":"2016-10-14T17:15:00","DisplayDateTime":"Friday, October 14 at 11:15 AM"}},{"Id":23,"Title":"Postgres present and future","Abstract":"Postgres 9.5 was just released a few months ago (as of the time of the talk). It has a number of new improvements including new JSONB functions, some analytical tooling, and of course upsert. We'll take a tour through each of these new features, how you use them with Python, Django, or just natively in SQL.\n\nThen we'll dive into what's coming in Postgres 9.6 as it will be nearly feature freeze timeframe you can start to know what's coming in the next 6 month timeframe.\n\nFinally we'll take a tour of some extensions. Extensions provide a great way to extend Postgres and the community around them has slowly built up over time. This includes Hyperloglog, hypothetical indexes, Citus, and possibly more.","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":29,"Text":"Database"}],"Speaker":{"Id":19,"DisplayName":"craigkerstiens"},"TimeSlot":{"StartTime":"2016-10-14T16:15:00","EndTime":"2016-10-14T17:15:00","DisplayDateTime":"Friday, October 14 at 11:15 AM"}},{"Id":56,"Title":"The Good and Bad of Software Metrics","Abstract":"Software Design Metrics have been a \"bad word\" in software development, especially for developers.  The reason for this is which metrics are used and how managers tend to quantify efficiency with these metrics.  This topic will cover which metrics you should use more frequently and how to apply them into software development processes.","Room":"Ballroom 3","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":8,"Text":"Agile"},{"Id":44,"Text":"Design"},{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"}],"Speaker":{"Id":47,"DisplayName":"Jason Pugh"},"TimeSlot":{"StartTime":"2016-10-14T16:15:00","EndTime":"2016-10-14T17:15:00","DisplayDateTime":"Friday, October 14 at 11:15 AM"}},{"Id":49,"Title":"Making the Unstable Stable - An Introduction to Testing","Abstract":"Does it always seem like bugs you’ve fixed keep coming back? Does it seem like when you fix one bug, two more crop up? What if I were to tell you there’s a better way? \n\nIn this presentation, we're going to explore how to make a code base more stable by using automated testing. To start, we'll explore the business case of why you should be writing tests by comparing three different companies that had different ideas when it came to testing and what the outcomes were. From there, we’ll look at the fundamentals of testing by talking about the pros/cons of unit, integration, and UI testing. Finally, we’ll look at some resources to learn how to write tests.\n\nIntended for developers who are new to testing, by the end of this presentation, you will  understand why you should write tests, and will have the concepts and tools to get started.","Room":"Ballroom 4","Tags":[{"Id":1,"Text":"Beginner"},{"Id":10,"Text":"TDD"},{"Id":11,"Text":"Dependency Injection"},{"Id":51,"Text":"Best Practicies"}],"Speaker":{"Id":45,"DisplayName":"Cameron Presley"},"TimeSlot":{"StartTime":"2016-10-14T16:15:00","EndTime":"2016-10-14T17:15:00","DisplayDateTime":"Friday, October 14 at 11:15 AM"}},{"Id":105,"Title":"Leadership Lessons from Your Brain","Abstract":"Everyone has an opinion about leadership. But where can you look for proven leadership techniques? Your brain! The presentation will examine four facts about how your brain operates.  Audience activities will help demonstrate some of these principles.  For each brain fact, an analogous leadership lesson will be presented.  You will learn four rock solid principles you can use to avoid the most common pitfalls of being a leader.  Each leadership lesson will be illustrated with examples from real life, in particuar with examples related to leading software development teams.  The leadership lessons will also be illustrated by Star Trek Series captain that didn’t understand that leadership lesson. Plus, you will learn some interesting facts about how your brain works. Learn leadership lessons from a proven source: your brain!","Room":"Ballroom 5","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":35,"Text":"Leadership"},{"Id":85,"Text":"Psychology"}],"Speaker":{"Id":31,"DisplayName":"Wayne Goode"},"TimeSlot":{"StartTime":"2016-10-14T16:15:00","EndTime":"2016-10-14T17:15:00","DisplayDateTime":"Friday, October 14 at 11:15 AM"}},{"Id":26,"Title":"Quantified Fitness","Abstract":"Kirsten has created a system, available on Github, which interacts with Fitbit, MyFitnessPal, and Withings, to create a health tracking system. It will send nagging notes via SMS using Twilio, change the colors of a Philips hue lightbulb based on progress for the day, and interact with any other API-driven service. Examples of all of these will be shared with you in a fantastic live demo! What Gets Measured Gets Done!\n","Room":"Ballroom 1","Tags":[{"Id":1,"Text":"Beginner"},{"Id":20,"Text":"IoT"}],"Speaker":{"Id":20,"DisplayName":"Kirsten Hunter"},"TimeSlot":{"StartTime":"2016-10-14T18:00:00","EndTime":"2016-10-14T19:00:00","DisplayDateTime":"Friday, October 14 at 1:00 PM"}},{"Id":63,"Title":"Data Science with Python and Friends","Abstract":"At the risk of overstating the obvious, data is everywhere.  And you need to make sense of it.  The tools and frameworks for data science that the Python programming language offers can help.  In this session we'll look at how plain Python can be used out of the box for ad-hoc analysis, libraries like numpy and pandas for more in depth problems and the amazing Jupyter notebook to share and collaborate with others. ","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":67,"Text":"Python"},{"Id":68,"Text":"Data Science"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2016-10-14T18:00:00","EndTime":"2016-10-14T19:00:00","DisplayDateTime":"Friday, October 14 at 1:00 PM"}},{"Id":14,"Title":"Being a Better Developer: Learning Skills That Aren't On Your Resume","Abstract":"As developers we spend a lot of time chasing technical skills like JavaScript, C++, and Angular. But the reality is that it the skills you have when you get a job are rarely the ones that you will use for your entire tenure. When I evaluate talent, I focus on the skills that don’t go well on a resume: communication, teamwork, estimation, and active listening. In this talk, I’ll delve into why these skills are crucial to being a great developer and how you acquire the skills.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":4,"Text":"Soft Skills"}],"Speaker":{"Id":13,"DisplayName":"Shawn Wildermuth"},"TimeSlot":{"StartTime":"2016-10-14T18:00:00","EndTime":"2016-10-14T19:00:00","DisplayDateTime":"Friday, October 14 at 1:00 PM"}},{"Id":17,"Title":"Code Review: How and When","Abstract":"You want to improve your software skills. That’s a given. You may be a mentor or a manager who needs to improve the knowledge sharing among your software developers across different projects. Code Reviews can do just that while improving code quality in your projects. Code Review not only builds developer team spirit but also offers new ways to improve a software solution. You’ll walk away from this session with in-depth understanding of Code Review to strengthen your team.","Room":"Ballroom 4","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":9,"Text":"Methodology"},{"Id":25,"Text":"Code Review"}],"Speaker":{"Id":15,"DisplayName":"Paul Gower"},"TimeSlot":{"StartTime":"2016-10-14T18:00:00","EndTime":"2016-10-14T19:00:00","DisplayDateTime":"Friday, October 14 at 1:00 PM"}},{"Id":69,"Title":"Heavy Server-side \"Lift\"ing for Rapid Development of Performant, Dynamic Web Applications","Abstract":"Imagine building performant, dynamic web applications with pure Scala. With the release of Lift 3.1, you can! Where Scala.js delivers on the promise of pure Scala, Lift 3.1 can deliver the same but without burdening the browser with large code downloads. Unlike with client-side rendering where the application needs a minimum of three round trips to the server before page load is complete, server-side rendering can load pre-rendered HTML immediately.\n\nIn previous versions of Lift, the developer must hand-write JavaScript or use a framework to achieve dynamic views. Now virtual-DOM diffing has been added to Lift’s powerful, secure framework allowing you to only write enough code to render application state into a page. In this way, you keep your application code purely functional without writing routines that mutate the state of the DOM. Not only is the burden on the browser lighter, but also by only updating the DOM after changes are committed on the server, the user learns to trust the application actually did what the user sees.","Room":"Ballroom 1","Tags":[{"Id":23,"Text":"Web"},{"Id":53,"Text":"Functional Programming"}],"Speaker":{"Id":17,"DisplayName":"Britany Meadows"},"TimeSlot":{"StartTime":"2016-10-14T19:30:00","EndTime":"2016-10-14T20:30:00","DisplayDateTime":"Friday, October 14 at 2:30 PM"}},{"Id":90,"Title":"Public Transportation and Accessibility: Using GIS and Open Data to Change Lives","Abstract":"Each day, someone is diagnosed with a disability that limits their mobility. Disabilities like these impact 52 million people in the United States alone. Often times it can limit their capability to use public transportation. In order to help people with disabilities lead an inclusive life, by making public transportation more accessible for them through technology, we have developed a free personalized trip planner called abilio. Through the use of our website and mobile app, users are able to plan their journey based on their individual needs such as how far they are able to walk and what methods of transportation they would like to use.","Room":"Ballroom 2","Tags":[{"Id":1,"Text":"Beginner"},{"Id":23,"Text":"Web"},{"Id":65,"Text":"Mobile"},{"Id":74,"Text":"GIS"},{"Id":75,"Text":"Accessibility"},{"Id":78,"Text":"Open Data"}],"Speaker":{"Id":58,"DisplayName":"Tyler Hughes"},"TimeSlot":{"StartTime":"2016-10-14T19:30:00","EndTime":"2016-10-14T20:30:00","DisplayDateTime":"Friday, October 14 at 2:30 PM"}},{"Id":53,"Title":"Public Speaking without Barfing on Your Shoes","Abstract":"Sooner or later, we are called on to speak. Out loud. In front of an audience. We may have to present something to our team, our leadership, or even a larger group of (--gulp--) mostly strangers. Public speaking strikes fear into the hearts of nearly everyone... especially those of us who are very shy. Imagining people in their underwear does not help.\n\nI have been speaking at conferences, user groups, and meetups for many years. However, as a shy introvert, this is not something that comes natural to me! If I can do it, so can you! In this fun and light-hearted talk, I want to share with you what I have learned from my hard-won experience. Introverts and extroverts alike will walk away with practical tips on preparing and giving effective presentations.","Room":"Ballroom 3","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"}],"Speaker":{"Id":2,"DisplayName":"David Neal"},"TimeSlot":{"StartTime":"2016-10-14T19:30:00","EndTime":"2016-10-14T20:30:00","DisplayDateTime":"Friday, October 14 at 2:30 PM"}},{"Id":104,"Title":"Lumen: Dive around THE fastest Php microservice.","Abstract":"I will show how to setup a Lumen environment against a database, make some quick routes and show the results in a fun / fast way.  \nI'll also do a quick comparison of the latest other fast Php based microframeworks.","Room":"Ballroom 4","Tags":[{"Id":1,"Text":"Beginner"},{"Id":29,"Text":"Database"},{"Id":84,"Text":"Backend"}],"Speaker":{"Id":63,"DisplayName":"Logan"},"TimeSlot":{"StartTime":"2016-10-14T19:30:00","EndTime":"2016-10-14T20:30:00","DisplayDateTime":"Friday, October 14 at 2:30 PM"}},{"Id":92,"Title":"Functional Programming Patterns in F#","Abstract":"You read the Gang of Four Design Patterns book years ago, and you use design patterns every day writing object-oriented software. But you've started dipping your toe into F# and functional programming. Must you jettison everything you know about design patterns in this new functional world? Or do they just look a little different?","Room":"Ballroom 1","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":52,"Text":"F#"},{"Id":53,"Text":"Functional Programming"},{"Id":56,"Text":"Patterns"}],"Speaker":{"Id":6,"DisplayName":"Brad Collins"},"TimeSlot":{"StartTime":"2016-10-14T21:00:00","EndTime":"2016-10-14T22:00:00","DisplayDateTime":"Friday, October 14 at 4:00 PM"}},{"Id":97,"Title":"A Whirlwind Tour of Django","Abstract":"Django is a leading web development framework written in Python, and has long been billed as \"the web framework for perfectionists with deadlines\".\n\nThis talk will quickly walk you through a typical django project, illustrating some of django's \"batteries included\" features and some common conventions used in many apps. ","Room":"Ballroom 2","Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":23,"Text":"Web"},{"Id":67,"Text":"Python"}],"Speaker":{"Id":57,"DisplayName":"Brad Montgomery"},"TimeSlot":{"StartTime":"2016-10-14T21:00:00","EndTime":"2016-10-14T22:00:00","DisplayDateTime":"Friday, October 14 at 4:00 PM"}},{"Id":43,"Title":"Rust: Removing the Sharp Edges from Systems Programming","Abstract":"Systems programming has a reputation for being difficult and fraught with dangers. Bjarne Stroustrup famously said \"C makes it easy to shoot yourself in the foot; C++ makes it harder, but when you do it blows your whole leg off”. When the creator of C++ makes a statement like that about the two mainstream systems programming languages, I can understand why you might believe that systems programming deserves such a notorious reputation. Nevertheless, systems programming does not have to have sharp edges. The Rust programming language will allow you to still produce fast, bare-metal programs while protecting your programs from the dreaded segfault and the uncertainty that arises from multi-threaded programming.\n\nCome learn the basics of programming in Rust while I show you how to develop a simple HTTP micro-service — an application that is usually reserved for higher-level languages but can easily and safely written in Rust.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":49,"Text":"Systems Programming"}],"Speaker":{"Id":22,"DisplayName":"Jonathan Creekmore"},"TimeSlot":{"StartTime":"2016-10-14T21:00:00","EndTime":"2016-10-14T22:00:00","DisplayDateTime":"Friday, October 14 at 4:00 PM"}},{"Id":27,"Title":"Integration Intoxication","Abstract":"Learn how to maximize your integration efforts between Sitecore and any other third-party API's and systems. Start with just a few basic samples all the way to deep integration with third-party API, in fact an intoxicating amount, many of which you've likely never heard of. Leverage and future-proof these in your Sitecore solutions, while keeping up with the future wave of ASP.NET Core and other technology shifts.\n\n\nCustomers want to maximize the investment (money they spend) on customization and integration. Write the right code, the right way, to provide the most reusability across all of the Sitecore Experience Platforms integration points.\n\nLearn about numerous third-party API's - over 40+.\nLearn how to minimize the impact of API changes and Sitecore upgrades.\nLearn how to embed, integrate and compile code from within content.\nLearn how to recognize when and how they should abstract their code into reusable components.\nIntroduction to ASP.NET Core 1 (formerly ASP.NET 5)\n\nCustomized code can be harder to maintain. Save money and increase reusability. Just step back and think about it before you code.\n\nNumerous Third Party API Integration Techniques With AND Without Sitecore\n\nBest Practices / Lessons Learned while building Advanced/Reusable Third Party API Integration Technologies\n\nMaxmized code reusability across - Sitecore 7.2, 7.5, 8, WinForms, ASP.NET and ASP.NET Core 1.","Room":"Ballroom 4","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":11,"Text":"Dependency Injection"},{"Id":17,"Text":"Azure"},{"Id":18,"Text":"Visual Studio"},{"Id":23,"Text":"Web"}],"Speaker":{"Id":21,"DisplayName":"David Walker"},"TimeSlot":{"StartTime":"2016-10-14T21:00:00","EndTime":"2016-10-14T22:00:00","DisplayDateTime":"Friday, October 14 at 4:00 PM"}},{"Id":60,"Title":"The Parallels Between User Experience and Leadership","Abstract":"In my focus on growing as a leader, I have noticed similarities between the characteristics of a strong User Experience practitioner and a strong leader.  How do characteristics like influence, communication, creative problem solving, and empathy connect these otherwise disparate fields?","Room":"Ballroom 5","Tags":[{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"},{"Id":59,"Text":"User Experience"},{"Id":60,"Text":"UX"}],"Speaker":{"Id":50,"DisplayName":"Jackie Spiegle"},"TimeSlot":{"StartTime":"2016-10-14T21:00:00","EndTime":"2016-10-14T22:00:00","DisplayDateTime":"Friday, October 14 at 4:00 PM"}},{"Id":55,"Title":"The Joy of Desktop Apps with Electron","Abstract":"Would you like to leverage your HTML, CSS, and JavaScript skills to build cross-platform desktop applications? Electron is an open source application shell created by GitHub, designed to make building great desktop applications easy. You may have already experienced Electron using applications such as Atom, Slack, or Visual Studio Code. In this talk, you will learn its features, how to quickly get started, and tips from my experience building Electron applications.","Room":"Ballroom 1","Tags":[{"Id":1,"Text":"Beginner"},{"Id":23,"Text":"Web"},{"Id":58,"Text":"Desktop"}],"Speaker":{"Id":2,"DisplayName":"David Neal"},"TimeSlot":{"StartTime":"2016-10-15T13:15:00","EndTime":"2016-10-15T14:15:00","DisplayDateTime":"Saturday, October 15 at 8:15 AM"}},{"Id":85,"Title":"Upon further Review:  Using Code reviews to improve your team and code","Abstract":"Code reviews are some of the most under-utilized methods of improving both code and developer quality.\nReviews can reduce technical debt, spread code-base knowledge, prevent bugs, help normalize the code base, and improve developers of all skill levels.\nStill, it is common that reviews are either ignored (because of time restrictions) or done improperly - focusing on the wrong issues with a code base.\nThis talk will help explain 1) different strategies and methods of code reviews 2) how to maximize time spent reviewing \n3) how to pitch time spent reviewing and refactoring to management","Room":"Ballroom 2","Tags":[{"Id":6,"Text":"Scrum"},{"Id":7,"Text":"Kanban"},{"Id":8,"Text":"Agile"},{"Id":9,"Text":"Methodology"},{"Id":25,"Text":"Code Review"},{"Id":28,"Text":"Testing"},{"Id":76,"Text":"Atlassian"}],"Speaker":{"Id":28,"DisplayName":"Chris Smeal"},"TimeSlot":{"StartTime":"2016-10-15T13:15:00","EndTime":"2016-10-15T14:15:00","DisplayDateTime":"Saturday, October 15 at 8:15 AM"}},{"Id":98,"Title":"Deploy an SSL-secured Go microservice with a free certificate from Let's Encrypt","Abstract":"Properly secured sessions guaranteed by SSL certificates are a critical component of the modern web site.  Many developers haven't had enough exposure to managing them because they've historically cost more than you'd want to spend on a toy project.  Enter Let's Encrypt, \"Let’s Encrypt is a free, automated, and open certificate authority, run for the public’s benefit.\"\n\nIn this session you'll see how you can quickly easily deploy your own free SSL certificate using the Caddy HTTP server.  We'll be securing a simple web app — a dice-rolling microservice written in the Go programming language.  If you've been curious about Let's Encrypt, Go or microservices, come on by!","Room":"Ballroom 3","Tags":[],"Speaker":{"Id":59,"DisplayName":"Daniel Pritchett"},"TimeSlot":{"StartTime":"2016-10-15T13:15:00","EndTime":"2016-10-15T14:15:00","DisplayDateTime":"Saturday, October 15 at 8:15 AM"}},{"Id":110,"Title":"Creating a Plug-in Architecture in .NET","Abstract":"Wouldn’t it be great to extend your application by just dropping in a DLL? Plug-in architectures make it possible and there are a few techniques that make it easy. This talk starts with a quick refresher on dependency injection and then builds onto that foundation to create a plug-in architecture. Diving deep into the code of a sample MVC application, you will see various plug-in strategies, explore the frameworks that take care of the heavy lifting, and understand where and how the plug-in points should be implemented.","Room":"Ballroom 4","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":11,"Text":"Dependency Injection"},{"Id":18,"Text":"Visual Studio"},{"Id":54,"Text":"Architecture"},{"Id":84,"Text":"Backend"}],"Speaker":{"Id":64,"DisplayName":"Ondrej Balas"},"TimeSlot":{"StartTime":"2016-10-15T13:15:00","EndTime":"2016-10-15T14:15:00","DisplayDateTime":"Saturday, October 15 at 8:15 AM"}},{"Id":19,"Title":"Log Analytics and Visualization using Microsoft Azure Operational Insights","Abstract":"Learn how Azure Operational Insights can help you collect massive amount of logs and machine data, explore and search them quickly, visualize results in rich dashboards, and get ready-made operational intelligence for your DevOps teams.","Room":"Ballroom 5","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":13,"Text":"DevOps"},{"Id":17,"Text":"Azure"},{"Id":26,"Text":"OMS"},{"Id":27,"Text":"Operational Insights"}],"Speaker":{"Id":18,"DisplayName":"Mickey Gousset [MVP]"},"TimeSlot":{"StartTime":"2016-10-15T13:15:00","EndTime":"2016-10-15T14:15:00","DisplayDateTime":"Saturday, October 15 at 8:15 AM"}},{"Id":57,"Title":"Break the norm, break the rules: These practical career hacks will help raise your stock as a team member and employee as you progress towards becoming a uniquely better leader","Abstract":"It is not easy to \"lead\" intelligent people, nor is it easy to gain the trust of a team. Whether you currently lead a team, aspire to become a leader, or if you enjoy the personal challenge associated with getting the most out of your workday, there are some simple and effective principles you can apply to help get you there. Join me as I share these tips and show how they helped me grow from being an intern to being a multi-project lead for government software projects within a single year. You will leave this session with a different perspective on the true signs of a good leader, tangible examples that are applicable in a wide range of work environments, and a set of career growth tactics that are provenly effective in a considerably demanding environment.","Room":"Ballroom 1","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":8,"Text":"Agile"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"},{"Id":36,"Text":"Life Hacks"}],"Speaker":{"Id":32,"DisplayName":"Lloyd Dendy"},"TimeSlot":{"StartTime":"2016-10-15T14:45:00","EndTime":"2016-10-15T15:45:00","DisplayDateTime":"Saturday, October 15 at 9:45 AM"}},{"Id":61,"Title":"Brief History of (.NET) Threading","Abstract":"Multi threading and parallelization have changed the way we write our code, but it has evolved significantly over the last few years. Having a good grasp on the history of threading can help with effectively using it in modern code bases. We'll look at threading in .NET from 1.0 all the way up to today and see how it can improve your understanding in .NET as well as in other technologies and languages.","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":41,"Text":"C#"},{"Id":64,"Text":"Threading"}],"Speaker":{"Id":52,"DisplayName":"David Mohundro"},"TimeSlot":{"StartTime":"2016-10-15T14:45:00","EndTime":"2016-10-15T15:45:00","DisplayDateTime":"Saturday, October 15 at 9:45 AM"}},{"Id":87,"Title":"Planning Web Services for the Enterprise","Abstract":"Designing a Service Oriented Architecture (SOA) or API is just the first step in delivering an enterprise service platform. How will these services be reused? How will developers gain access to them? What kind of approval process is required for them to get access? How will performance be monitored? This session will show how Application Services Governance provides the tools to deliver agility, cost efficiency, risk management and stability to your consumers.","Room":"Ballroom 3","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"},{"Id":55,"Text":"Microservices"},{"Id":56,"Text":"Patterns"},{"Id":57,"Text":"Business"}],"Speaker":{"Id":36,"DisplayName":"Gaines Kergosien"},"TimeSlot":{"StartTime":"2016-10-15T14:45:00","EndTime":"2016-10-15T15:45:00","DisplayDateTime":"Saturday, October 15 at 9:45 AM"}},{"Id":33,"Title":"Traders of Knowledge","Abstract":"What keeps us from moving forward in our careers? Why do we feel like imposters? Learn how to overcome these obstacles and chart a course for others to follow. It’s time to become traders of knowledge.","Room":"Ballroom 4","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"}],"Speaker":{"Id":29,"DisplayName":"Buddy Reno"},"TimeSlot":{"StartTime":"2016-10-15T14:45:00","EndTime":"2016-10-15T15:45:00","DisplayDateTime":"Saturday, October 15 at 9:45 AM"}},{"Id":3,"Title":"Converting to Agile: Answering the Common Questions","Abstract":"Moving to an Agile mentality can be challenging.  There are many processes that are not inherent to a team that has been doing Waterfall their entire career.  In this session we will be breaking down the sections of Scrum including the meetings, reports, and processes.  We will discuss what the meetings are as well as dive into why they are all important.  Why are you being asked to have code ready in 2 weeks? Why do we have to spend time every morning in a stand up? Why do I have to participate in a retrospective? What the heck is a ‘self-organizing’ team and why is it important?  What is velocity and why should I care? What do you mean the requirements changed? When do requirement changes get implemented/added to the scope? We will answer these questions and more! At the end of this session, you should have a better understanding of the meetings and processes in an Agile environment and why they are important. You can then take these answers back for when you are asked the common questions!","Room":"Ballroom 5","Tags":[{"Id":1,"Text":"Beginner"},{"Id":6,"Text":"Scrum"},{"Id":7,"Text":"Kanban"},{"Id":8,"Text":"Agile"},{"Id":9,"Text":"Methodology"}],"Speaker":{"Id":7,"DisplayName":"Heather Tooill"},"TimeSlot":{"StartTime":"2016-10-15T14:45:00","EndTime":"2016-10-15T15:45:00","DisplayDateTime":"Saturday, October 15 at 9:45 AM"}},{"Id":101,"Title":"What's New in Bootstrap 4","Abstract":"Bootstrap has been around for 5 years now and has helped led many of the standards arounds developing mobile first websites and applications.  This has certainly benefited developers in putting together better user experiences using Bootstrap’s various UI concepts.\n\nIn this talk we will be looking at the latest release of Bootstrap 4 to show what's new and different about it compared to Bootstrap 3.\n","Room":"Ballroom 1","Tags":[{"Id":23,"Text":"Web"},{"Id":39,"Text":"Bootstrap"},{"Id":43,"Text":"FrontEnd"},{"Id":44,"Text":"Design"},{"Id":47,"Text":"Responsive"},{"Id":59,"Text":"User Experience"},{"Id":60,"Text":"UX"}],"Speaker":{"Id":62,"DisplayName":"Brian Lankford"},"TimeSlot":{"StartTime":"2016-10-15T16:15:00","EndTime":"2016-10-15T17:15:00","DisplayDateTime":"Saturday, October 15 at 11:15 AM"}},{"Id":73,"Title":"Fun with Markov Chains","Abstract":"Have you seen those funny accounts online that are strange, yet almost coherent? The twitter accounts like captain_markov & horse_ebooks, or the venerable King James Programming on tumblr? \n\nThey're generated by Markov Chains! This talk will take you on a journey into one of the original markov chain bots, dig into some python source code, and explain how markov chains work without using too many mathematical equations.","Room":"Ballroom 2","Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":31,"Text":"Machine Learning"},{"Id":67,"Text":"Python"}],"Speaker":{"Id":57,"DisplayName":"Brad Montgomery"},"TimeSlot":{"StartTime":"2016-10-15T16:15:00","EndTime":"2016-10-15T17:15:00","DisplayDateTime":"Saturday, October 15 at 11:15 AM"}},{"Id":18,"Title":"Start writing declarative templates and realize the vast benefits you get from well defined boundaries in your web applications.","Abstract":"I will be showing off some concepts that have been fleshed out quite thoroughly by local developers, most noteably Bryan Powell, the author and main contributor of the Pakyow framework.\n\nWe will discuss the [View Transformation Protocol](https://pakyow.org/docs/concepts/view-transformation-protocol) and explore many of the game changing benefits to having strong boundaries between your template architecture and your data.\n\nTo show that these concepts are framework agnostic, I'll be demonstrating how to build realtime syncing views in my own library I have build in elixir, so you'll also get to see some of the feature set of elixir and the phoenix framework.","Room":"Ballroom 3","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":23,"Text":"Web"},{"Id":24,"Text":"Clean Code"},{"Id":88,"Text":"elixir"},{"Id":90,"Text":"phoenix"}],"Speaker":{"Id":16,"DisplayName":"danmcguire"},"TimeSlot":{"StartTime":"2016-10-15T16:15:00","EndTime":"2016-10-15T17:15:00","DisplayDateTime":"Saturday, October 15 at 11:15 AM"}},{"Id":65,"Title":"A Lap Around Xamarin","Abstract":"Let's face it, mobile development is hard.  Multitouch, connectivity, GPS, battery conservation, accelerometer, less compute power, small screen size and a less than pixel accurate pointing device are just a few of the challenges developers face.  Oh yeah, mobile apps need to work on multiple platforms.  Instead of learning multiple languages and tools, just use Xamarin.  Xamarin allows .NET developers to target iOS, Android MacOS and more sharing up to 70% of code between platforms.  That's code that only needs to be designed, written, tested and deployed once.  Xamarin tools work across platforms with Xamarin Studio on macOS and Visual Studio on Windows.  It also integrates very well with cloud services such as Azure and devops services like Visual Studio Teams Services.  This session will be a survey of what the Xamarin platform offers and how you can take advantage of it.","Room":"Ballroom 4","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":17,"Text":"Azure"},{"Id":18,"Text":"Visual Studio"},{"Id":41,"Text":"C#"},{"Id":52,"Text":"F#"},{"Id":65,"Text":"Mobile"},{"Id":66,"Text":"Xamarin"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2016-10-15T16:15:00","EndTime":"2016-10-15T17:15:00","DisplayDateTime":"Saturday, October 15 at 11:15 AM"}},{"Id":84,"Title":"Optimism: How do you talk to yourself and your coworkers?","Abstract":"Are you promoting positivity and growth within yourself and with your teammates? Inspired by a presentation given by Reginald Braithwaite on optimism, which was inspired by the book Learned Optimism by Martin E.P. Seligman. We will explore the differences between the self-talk of an optimistic person and a pessimistic person. We will also examine the differences between outward optimism and pessimism in a collaborative environment and whether or not each is the same as our self-talk. After we have a grasp on these key differences, we can see what is needed to shape our inner and outer voices towards optimism for a happier and healthier inner voice and the knowledge to facilitate a more positive and productive environment with the people we work with every day.","Room":"Ballroom 5","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":73,"Text":"Mental Health"}],"Speaker":{"Id":17,"DisplayName":"Britany Meadows"},"TimeSlot":{"StartTime":"2016-10-15T16:15:00","EndTime":"2016-10-15T17:15:00","DisplayDateTime":"Saturday, October 15 at 11:15 AM"}},{"Id":51,"Title":"Microservices: Lessons from the Trenches","Abstract":"Almost everywhere you look, the word microservices appears. Many businesses are now investing heavily in this new approach to architecture. But is it really new and are they truly adding value, or are they simply increasing their headaches? These are the type of questions this session sets out to answer.\n\nTaken from more than a year of consulting with numerous clients, this session focuses on lessons learned in microservice architecture, development and implementation and deals with practical ways you can prepare for, build and implement microservices in your organization.\n\nKey Topics\n· What is microservices architecture and is it right for you\n· The proper motivation for moving to microservices\n· Why microservices might not be right for you\n· Why planning is extremely important and how to set a proper foundation\n· Pitfalls and how to overcome them\n· How to implement microservices from a high level","Room":"Ballroom 1","Tags":[{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"},{"Id":55,"Text":"Microservices"}],"Speaker":{"Id":35,"DisplayName":"Gregory A. Beamer"},"TimeSlot":{"StartTime":"2016-10-15T18:00:00","EndTime":"2016-10-15T19:00:00","DisplayDateTime":"Saturday, October 15 at 1:00 PM"}},{"Id":24,"Title":"Becoming a Polyglot","Abstract":"In this talk, I’ll demonstrate the engine for a Fortune Cookie Server (fortune cookies will be served!) The front end Single Page Application will stay the same, the backend Mongo database will stay the same, but the API engine will be represented in perl, python, ruby, php and node.\n\nMany people understand the very basics of several languages, all the way to Hello World. However, this isn’t a full fledged application and it’s challenging to make the translations in your head between all the different dialects (interpreted languages aren’t really different from each other like different languages – they work very much the same and the only difference is in the structure of the language). Out in our community are many people who firmly believe that moving from Ruby to Perl is not possible, that it’s very difficult to learn a new language, that it makes no sense to try to understand what “foreign” code might be doing.\n\nI’ll encourage developers to pull the repository during the talk and play with the examples as I talk about them. This interactive talk aims to help developers feel more comfortable reading and understanding programming languages other than their native coding language.","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":24,"Text":"Clean Code"}],"Speaker":{"Id":20,"DisplayName":"Kirsten Hunter"},"TimeSlot":{"StartTime":"2016-10-15T18:00:00","EndTime":"2016-10-15T19:00:00","DisplayDateTime":"Saturday, October 15 at 1:00 PM"}},{"Id":71,"Title":"Are you really an Anarchist? Why managers, rules, hierarchy, property, and other things that geeks hate are necessary","Abstract":"Using examples of what can go wrong taken from real horror stories, this talk will argue the case for building organizations that aren't flat, projects that aren't open, spaces that aren't common, and stores that aren't pay what you want. A case will be made for the necessity and ease of planning out an organizational structure before declaring that rules just get in the way and diving in. Do you really trust that your peers are reasonable, or that everyone will do the right thing with your project?","Room":"Ballroom 3","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":9,"Text":"Methodology"},{"Id":27,"Text":"Operational Insights"},{"Id":57,"Text":"Business"}],"Speaker":{"Id":53,"DisplayName":"Charlotte M. Ellett"},"TimeSlot":{"StartTime":"2016-10-15T18:00:00","EndTime":"2016-10-15T19:00:00","DisplayDateTime":"Saturday, October 15 at 1:00 PM"}},{"Id":20,"Title":"Automate Your Testing With DevTest Labs","Abstract":"Tired of spending hours or days building out labs to test your code? Welcome to the new world of Azure DevTest Labs. In this session, you'll learn how Azure DevTest Labs allow you to quickly provision development and test environments, create new virtual machines using reusable templates, and automate shutdowns to minimize costs. Come see the future of testing.","Room":"Ballroom 4","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":8,"Text":"Agile"},{"Id":13,"Text":"DevOps"},{"Id":14,"Text":"VSTS"},{"Id":16,"Text":"Build"},{"Id":17,"Text":"Azure"},{"Id":18,"Text":"Visual Studio"}],"Speaker":{"Id":18,"DisplayName":"Mickey Gousset [MVP]"},"TimeSlot":{"StartTime":"2016-10-15T18:00:00","EndTime":"2016-10-15T19:00:00","DisplayDateTime":"Saturday, October 15 at 1:00 PM"}},{"Id":74,"Title":"Open Source Success: The long journey to 300 daily downloads","Abstract":"This talk details Packet Sender's ( https://packetsender.com/ ) humble beginnings of an obscure freeware app that nobody cared about to what it is today: A respected open source desktop project that gets downloaded 300 times a day and can be found referenced by high-profile companies and universities.\n\nGetting there was long and gradual. Some of the topics covered and the reasons behind them: multiple app overhauls, multiple web site overhauls, adding mobile versions, abandoning the mobile versions, implementing a feedback system, abandoning the feedback system, the decision to go open source, and finally, actually earning paid gigs from the invention.","Room":"Ballroom 5","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":23,"Text":"Web"},{"Id":33,"Text":"Career"},{"Id":44,"Text":"Design"},{"Id":54,"Text":"Architecture"},{"Id":57,"Text":"Business"},{"Id":58,"Text":"Desktop"}],"Speaker":{"Id":3,"DisplayName":"Dan Nagle"},"TimeSlot":{"StartTime":"2016-10-15T18:00:00","EndTime":"2016-10-15T19:00:00","DisplayDateTime":"Saturday, October 15 at 1:00 PM"}},{"Id":29,"Title":"Coding for the Industrial Internet of Things","Abstract":"Predix is a platform-as-a-service that offers solutions to the challenges facing Industrial IoT.  It is being used in a wide variety of industrial use cases for aviation, healthcare, transportation, manufacturing and energy.\n\nWe will dive into how Predix has been built on top of Cloud Foundry, an Open-Source project to deliver cloud-native applications.  This architecture provides a great deal of flexibility and power to develop with many different programming languages using best practices for security, microservices, and CI/CD.","Room":"Ballroom 1","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":12,"Text":"Security"},{"Id":13,"Text":"DevOps"},{"Id":20,"Text":"IoT"},{"Id":27,"Text":"Operational Insights"}],"Speaker":{"Id":27,"DisplayName":"Jayson DeLancey"},"TimeSlot":{"StartTime":"2016-10-15T19:30:00","EndTime":"2016-10-15T20:30:00","DisplayDateTime":"Saturday, October 15 at 2:30 PM"}},{"Id":50,"Title":"Taking a Gamble on F#: Implementing Blackjack","Abstract":"Have you heard a lot about about functional programming, and aren’t sure how to get started? Have you tried learning the concepts, but still having a hard time applying them to a real problem? Then this talk is for you! In this presentation I’ll walk you through how to model the classic card game, Blackjack, using F#.\n\nIntended for developers with little to no functional experience, my talk will introduce you to the basic concepts of functional programming while applying them to Blackjack. By the end of the presentation, you’ll know the basic concepts, how to apply them, and a working game.\n","Room":"Ballroom 2","Tags":[{"Id":2,"Text":"Intermediate"},{"Id":52,"Text":"F#"},{"Id":53,"Text":"Functional Programming"}],"Speaker":{"Id":45,"DisplayName":"Cameron Presley"},"TimeSlot":{"StartTime":"2016-10-15T19:30:00","EndTime":"2016-10-15T20:30:00","DisplayDateTime":"Saturday, October 15 at 2:30 PM"}},{"Id":103,"Title":"Vagrant vs. Docker","Abstract":"This would actually be a educational comparison and clarification of what the two systems actually do, why to use them, and basically explaining what all the hoopla is about.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":13,"Text":"DevOps"},{"Id":84,"Text":"Backend"}],"Speaker":{"Id":63,"DisplayName":"Logan"},"TimeSlot":{"StartTime":"2016-10-15T19:30:00","EndTime":"2016-10-15T20:30:00","DisplayDateTime":"Saturday, October 15 at 2:30 PM"}},{"Id":52,"Title":"Software Product Development: Lessons From Buildings","Abstract":"Cities, castles, cathedrals...and McDonald's: Humans have been building systems out of non-digital stuff for a long time. Those buildings that stand all around us are public documentation of lessons learned in the design of systems as products.  Join a tour of how to read these patterns from the built environment, which may give advance warning signs for future product development.","Room":"Ballroom 4","Tags":[{"Id":44,"Text":"Design"},{"Id":56,"Text":"Patterns"},{"Id":57,"Text":"Business"},{"Id":59,"Text":"User Experience"}],"Speaker":{"Id":46,"DisplayName":"Sarah Hicks"},"TimeSlot":{"StartTime":"2016-10-15T19:30:00","EndTime":"2016-10-15T20:30:00","DisplayDateTime":"Saturday, October 15 at 2:30 PM"}},{"Id":31,"Title":"Ratchet: A New View on Web Apps","Abstract":"Web programming. It's not rocket science, right? Perhaps that is true, but we're still getting it wrong.\n\nRatchet is an Elixir library that implements a new strategy for building views in your web application. Inspired by the Pakyow framework's View Transformation Protocol, Ratchet separates the structural concerns of web views from their data. A day is coming of designers and engineers working happily together without getting in each other's way.\n\nIn this talk you will learn about the benefits of separating structural view logic from the backend's implementation. You will see how Ratchet leverages Elixir's functional programming foundation to transform plain HTML view templates with complex data. Beyond the theory, you'll get down to practical examples of how these concepts apply to real applications.\n\nWith these boundaries established new ways of thinking may be introduced to reclaim portions of the web forsaken to thick JavaScript clients.","Room":"Ballroom 5","Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":23,"Text":"Web"}],"Speaker":{"Id":5,"DisplayName":"Jay Hayes"},"TimeSlot":{"StartTime":"2016-10-15T19:30:00","EndTime":"2016-10-15T20:30:00","DisplayDateTime":"Saturday, October 15 at 2:30 PM"}},{"Id":46,"Title":"How to Hire Programmers (You'll Want as Teammates)","Abstract":"Few things will ruin a great job faster than a bad hire, but there are very few resources to help you hire better. In fact, most programmers and hiring managers have little or no training in hiring programmers and just wing it. In this session, you'll learn that most advice for hiring programmers could be setting you up for failure because it is applicable to very few teams and organizations. You'll learn how to decide which programmer type is best for your project; the eight factors that reveal if a programmer will be a good fit for your team; how to talk about your project so it stands out from the crowd; and how to perform programmer interviews that are fun and revealing. This session will help you make your next teammate a great fit.","Room":"Ballroom 1","Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":35,"Text":"Leadership"},{"Id":36,"Text":"Life Hacks"}],"Speaker":{"Id":40,"DisplayName":"Scott Drake"},"TimeSlot":{"StartTime":"2016-10-15T21:00:00","EndTime":"2016-10-15T22:00:00","DisplayDateTime":"Saturday, October 15 at 4:00 PM"}},{"Id":68,"Title":"High Class PowerShell: Objects and Classes in PowerShell","Abstract":"In this session we will focus on the ability to create custom objects in PowerShell, covering PowerShell versions 3 to 5. You'll see how to create objects using pure PowerShell, as well as how to incorporate C# code into your PowerShell scripts. We'll then look at the new Class and Enum types included with PowerShell 5, and how to incorporate classes into your own modules. \n\nThis session is for people already familiar with PowerShell and are wanting to take their skills to the advanced level by learning how to create their own objects and classes. \n","Room":"Ballroom 2","Tags":[{"Id":1,"Text":"Beginner"},{"Id":13,"Text":"DevOps"},{"Id":70,"Text":"PowerShell"}],"Speaker":{"Id":55,"DisplayName":"ArcaneCode"},"TimeSlot":{"StartTime":"2016-10-15T21:00:00","EndTime":"2016-10-15T22:00:00","DisplayDateTime":"Saturday, October 15 at 4:00 PM"}},{"Id":88,"Title":"From Developer to Data Scientist","Abstract":"Due to recent advances in technology, humanity is collecting vast amounts of data at an unprecedented rate, making the skills necessary to mine insights from this data increasingly valuable. So what does it take for a Developer to enter the world of data science?\n\nJoin me on a journey into the world of big data and machine learning where we will explore what the work actually looks like, identify which skills are most important, and design a roadmap for how you too can join this exciting and profitable industry.","Room":"Ballroom 3","Tags":[{"Id":1,"Text":"Beginner"},{"Id":30,"Text":"AI"},{"Id":31,"Text":"Machine Learning"},{"Id":67,"Text":"Python"},{"Id":68,"Text":"Data Science"},{"Id":72,"Text":"Big Picture"},{"Id":77,"Text":"Big Data"},{"Id":79,"Text":"R"}],"Speaker":{"Id":36,"DisplayName":"Gaines Kergosien"},"TimeSlot":{"StartTime":"2016-10-15T21:00:00","EndTime":"2016-10-15T22:00:00","DisplayDateTime":"Saturday, October 15 at 4:00 PM"}},{"Id":93,"Title":"Stop Playing Games and Start Making Them!","Abstract":"Why spend so much time only playing games when you could be making them instead? We're sure you have some ideas on what makes a game fun, so don't let those ideas go to waste! Put them to use by making that game a reality, and earn some useful experience in skills such as programming, design, digital art, and sound production. Put down the controller and learn how to create your own games for both fun and profit. Anyone can make a game!","Room":"Ballroom 4","Tags":[{"Id":1,"Text":"Beginner"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":44,"Text":"Design"}],"Speaker":{"Id":53,"DisplayName":"Charlotte M. Ellett"},"TimeSlot":{"StartTime":"2016-10-15T21:00:00","EndTime":"2016-10-15T22:00:00","DisplayDateTime":"Saturday, October 15 at 4:00 PM"}},{"Id":109,"Title":"DevSpace: the Good, the Bad, and the Ugly","Abstract":"This session is your opportunity to give back. I will spend a few minutes talking about what it took to organize on the conference. Then, I want to go around the room and hear what everyone thought was the good, the bad, and the ugly. What worked and what did not. This is your chance to give feedback straight to the conference.","Room":"Ballroom 5","Tags":[{"Id":27,"Text":"Operational Insights"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"},{"Id":36,"Text":"Life Hacks"},{"Id":57,"Text":"Business"},{"Id":72,"Text":"Big Picture"}],"Speaker":{"Id":1,"DisplayName":"Chris Gardner"},"TimeSlot":{"StartTime":"2016-10-15T21:00:00","EndTime":"2016-10-15T22:00:00","DisplayDateTime":"Saturday, October 15 at 4:00 PM"}}]