[{"Id":194,"Title":"Think outside the box: Change your mind, change your life","Abstract":"There is a myth human beings on use 10% of their brains. While this is a myth, it is true a large percentage of people only live up to a small percentage of their potential. Much of the failure to achieve is due to limiting beliefs and unchallenged biases.\n\nYou live in a box. The box protects you from the outside world, but it also limits your potential. False beliefs and biases shape your life, throwing roadblocks on your success. But you have the power to break free from your box and live the life you desire. Are you willing to take that first step?\n\nWhat if you could learn to solve your problems with ease? What if you could live a better life? What if you could live up to your potential? You can! Will you?\n","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":36,"Text":"Life Hacks"}],"Speaker":{"Id":35,"DisplayName":"Gregory A. Beamer"},"TimeSlot":{"StartTime":"2017-10-13T13:00:00","EndTime":"2017-10-13T14:30:00","DisplayDateTime":"Friday, October 13 at 8:00 AM"}},{"Id":146,"Title":"C++17: Not Your Father’s C++","Abstract":"Many people treat C++ as a glorified upgrade to another language.  I mean, it’s just C with classes, right?  Not true at all!  With a constantly updating standard, C++ continues to add new features that are comparable to other languages.  C++11/C++14 gave us lambdas, type inference, threading, tuples, and so much more.  What could C++17 possibly give us?  Come to this talk and find out the awesome features coming to the next standard version of C++, plus a sneak peek of what's down the road for C++.\n\nThis talk is intended for developers familiar with the C++ language.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":106,"Text":"C++"}],"Speaker":{"Id":66,"DisplayName":"Pat Viafore"},"TimeSlot":{"StartTime":"2017-10-13T15:00:00","EndTime":"2017-10-13T16:00:00","DisplayDateTime":"Friday, October 13 at 10:00 AM"}},{"Id":148,"Title":"Caching in .NET Core for Fun and Profit","Abstract":"Ever wonder how you might use caching to improve the performance and speed of your website? Are you looking to improve the user experience for your web application? We'll discuss the ins and outs of caching in .NET Core, when and where to apply a caching strategy, and considerations for each scheme. If time (and wifi) allow we'll look into options available in Azure. ","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":41,"Text":"C#"},{"Id":108,"Text":"Caching"}],"Speaker":{"Id":8,"DisplayName":"John Callaway"},"TimeSlot":{"StartTime":"2017-10-13T15:00:00","EndTime":"2017-10-13T16:00:00","DisplayDateTime":"Friday, October 13 at 10:00 AM"}},{"Id":203,"Title":"Expect More: Getting Started with JavaScript Testing","Abstract":"The importance of testing is consistently proclaimed as invaluable. Testing is no simple task and can be daunting for newcomers to start. This workshop will include an introduction to testing and cover basic testing setup. We will use the Jest platform to test functions and React Components.\n\nJavaScript for many years has been the wild west of programming. Testing for many has meant pushing to production and hoping for the best. As JavaScript has modernized, test frameworks has also progressed to equal heights. Leaving us with the all important question of, “How do I properly test this?”\n\nAlong with understanding how to test, there is a persistent pull on our time. Testing is typically is the part of a feature or project that is dropped due to time lines. Leveraging and integrating tests in the development work flow can heighten code confidence, increase maintainability, and simplify debugging. Enjoy these array of exercises to solidify your appreciation of the art of testing.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":10,"Text":"TDD"},{"Id":99,"Text":"javascript"}],"Speaker":{"Id":104,"DisplayName":"Kyle Welch"},"TimeSlot":{"StartTime":"2017-10-13T15:00:00","EndTime":"2017-10-13T16:00:00","DisplayDateTime":"Friday, October 13 at 10:00 AM"}},{"Id":215,"Title":"Writing Great Requirements - Tips From An Engineer's Perspective","Abstract":"It can often seem like the divide between the developers and the rest of the company is too wide to cross. Nowhere can this divide seem larger than when writing requirements or user stories. At times, it's as if the two groups speak entirely different languages, especially when clearly stated expectations somehow still produce software which isn't quite what the business needs.\n\nIn this fun, interactive session, we'll discuss common ways in which requirements can fall short of what engineers need, and how to fix them. The result will be a greater understanding of how to bridge the gap between what the business needs and what the developers need.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":8,"Text":"Agile"},{"Id":113,"Text":"Conversations"},{"Id":135,"Text":"Requirements"}],"Speaker":{"Id":114,"DisplayName":"Craig Burton"},"TimeSlot":{"StartTime":"2017-10-13T15:00:00","EndTime":"2017-10-13T16:00:00","DisplayDateTime":"Friday, October 13 at 10:00 AM"}},{"Id":239,"Title":"Making developers lives easier with SQL Server 2016","Abstract":"SQL Server 2016 is said to be the biggest leap forward in the Microsoft Data Platform history. In this session, we will learn about the rich set of capabilities of SQL Server 2016 and the new features relating to Performance and Productivity.\n\nDo you want insights into how your data has changed over a period of time? Are you using JSON as your data interchange format and want to integrate with SQL Server? Do you wish to have more statistical/historical information while troubleshooting a T-SQL performance issue? Do you face any problem while troubleshooting a long running query? Have you encountered performance issues after server/application upgrades? \n\nIf your answer to any of the above questions is YES, then this session is for YOU. During this content rich and demo intensive session, you will understand the rich capabilities of SQL Server 2016 and how the life of a SQL Developer is getting transformed with features like Query Store, Live Query Statistics, Comparing Execution Plans, Built-in JSON Support, Temporal Database and other nice T-SQL enhancements.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":29,"Text":"Database"},{"Id":114,"Text":"SQLServer"},{"Id":141,"Text":"Productivity"}],"Speaker":{"Id":71,"DisplayName":"Samir Behara"},"TimeSlot":{"StartTime":"2017-10-13T15:00:00","EndTime":"2017-10-13T16:00:00","DisplayDateTime":"Friday, October 13 at 10:00 AM"}},{"Id":122,"Title":"Postgres at any scale","Abstract":"Postgres is a great database for storing your data. But, as an application developer you don't always pay attention to what's happening under the hood and it can affect performance. We'll look at all the things you need to know for each stage of your app from small data, to moderate sized data, to truly large scale of up to 100's of TBs and what you need to know and do at each stage to things performing well. In particular we'll cover:\n\n* Indexing\n* Understanding explain plans\n* Vacuum \n* Caching strategies\n* Counting\n* Sharding\n* Sketch algorithms","Room":"Ballroom 1","SessionLength":30,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":3,"Text":"Advanced"},{"Id":29,"Text":"Database"}],"Speaker":{"Id":19,"DisplayName":"craigkerstiens"},"TimeSlot":{"StartTime":"2017-10-13T16:30:00","EndTime":"2017-10-13T17:00:00","DisplayDateTime":"Friday, October 13 at 11:30 AM"}},{"Id":189,"Title":"Introduction to Named Data Networking","Abstract":"Current Internet was designed for connecting two or more distant resources with each other. The problem that the Internet solved was how do I access a printer/server remotely. Even security came as an after thought.\nHowever in today's Internet consumers no longer care as to which computer they connect to as long as they get the data. Furthermore, consumers do want their data to be secure independent of the transport.\nIn 2009, Van Jacobson, author of TCP congestion control which helped saved the Internet from congestion, delivered a talk to PARC about a new type of Internet architecture known as Content Centric Network (CCN). Named Data Networking (NDN) was developed with NSF funding based on CCN. By having a name as its primary abstraction, NDN provides in-network caching, inherent security, and robust mobility support that the current Internet lacks. It also simplifies writing network applications.","Room":"Ballroom 5","SessionLength":30,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":54,"Text":"Architecture"},{"Id":111,"Text":"Open Source"},{"Id":123,"Text":"NETWORKING"},{"Id":124,"Text":"INTERNET"},{"Id":125,"Text":"FUTURE OF INTERNET"}],"Speaker":{"Id":96,"DisplayName":"Ashlesh"},"TimeSlot":{"StartTime":"2017-10-13T16:30:00","EndTime":"2017-10-13T17:00:00","DisplayDateTime":"Friday, October 13 at 11:30 AM"}},{"Id":228,"Title":"Vital Soft Skills to Bring Your Career Full Circle","Abstract":"Soft skills are not the key to landing a job as a developer, but they are required if you want to advance in your career. We will walk through a list of foundational skills anyone can master that assist developers and entrepreneurs in growing their influence into management and business ownership. At the end of the session, I will provide attendees with a list of resources to pursue the skills they need to take the next step to growing their career. ","Room":"Ballroom 2","SessionLength":30,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"}],"Speaker":{"Id":84,"DisplayName":"Brad Miller"},"TimeSlot":{"StartTime":"2017-10-13T16:30:00","EndTime":"2017-10-13T17:00:00","DisplayDateTime":"Friday, October 13 at 11:30 AM"}},{"Id":231,"Title":"An introduction to the Cloud via Amazon Web Services","Abstract":"This talk will be a high level overview of cloud, specifically Amazon Web Services (AWS).  We will cover the basic concepts of the cloud, including  storage and databases, IoT, big data services, security, and computing resources, including what services exist, as well as various use cases for each service.  Additionally, we will cover the best method of learning about AWS, including tutorial resources, and good hands on projects to get started.","Room":"Ballroom 3","SessionLength":30,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":13,"Text":"DevOps"},{"Id":63,"Text":"AWS"},{"Id":137,"Text":"Cloud"}],"Speaker":{"Id":28,"DisplayName":"Chris Smeal"},"TimeSlot":{"StartTime":"2017-10-13T16:30:00","EndTime":"2017-10-13T17:00:00","DisplayDateTime":"Friday, October 13 at 11:30 AM"}},{"Id":266,"Title":"Load Balancing Web Apps & Games on OpenShift","Abstract":"Do you worry about load balancing with your online app or game? Ever considered containerization? Or just want to learn more about what containerization is and how to do it? We'll go through a quick overview of VMs, containers, Kubernetes, image streams, and using open source to put your project online with OpenShift.","Room":"Ballroom 4","SessionLength":30,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":23,"Text":"Web"},{"Id":109,"Text":"Docker"},{"Id":111,"Text":"Open Source"},{"Id":112,"Text":"Kubernetes"}],"Speaker":{"Id":53,"DisplayName":"Charlotte M. Ellett"},"TimeSlot":{"StartTime":"2017-10-13T16:30:00","EndTime":"2017-10-13T17:00:00","DisplayDateTime":"Friday, October 13 at 11:30 AM"}},{"Id":115,"Title":"Puppets, Chefs, and Ansibles - Making sense of the provisioning circus","Abstract":"COME ONE! COME ALL! As we explore the circus of server provisioning and automation tools. \n\nWatch the puppet show and learn how to make your servers dance at your command! We'll manifest production environments right before your very eyes! \n\nSee the cooking show where our Chef whips up a fresh batch of servers from their playbooks ready to bring your application to your visitors! \n\nLastly, watch how ansible makes easy work of automating everything from application deployments to server updates. \n\nWe'll even cover your servers in fabric - the pythonic remote execution tool for server automation! \n\nWe'll give a whirlwind tour of each tool and show real world examples of usage. We'll compare, contrast, and maybe enjoy some cotton candy while we wait for the tools to run!","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":9,"Text":"Methodology"},{"Id":13,"Text":"DevOps"},{"Id":27,"Text":"Operational Insights"}],"Speaker":{"Id":65,"DisplayName":"Joe Ferguson"},"TimeSlot":{"StartTime":"2017-10-13T18:00:00","EndTime":"2017-10-13T19:00:00","DisplayDateTime":"Friday, October 13 at 1:00 PM"}},{"Id":121,"Title":"Using Azure IoT Services & PowerBI to Monitor Robot Telemetry","Abstract":"Realtime telemetry of systems is a valuable tool for debugging and making predictions about when those systems will fail. In this talk, I'll use a fun T-shirt tossing robot to demonstrate how to collect and analyze telemetry data from your apps (or robots!) using Azure services and PowerBI. Warning: T-shirts and data will be flying!","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":17,"Text":"Azure"},{"Id":19,"Text":"Hardware"},{"Id":20,"Text":"IoT"},{"Id":21,"Text":"Windows IoT Core"},{"Id":22,"Text":"Raspberry Pi"}],"Speaker":{"Id":11,"DisplayName":"Ian Lee"},"TimeSlot":{"StartTime":"2017-10-13T18:00:00","EndTime":"2017-10-13T19:00:00","DisplayDateTime":"Friday, October 13 at 1:00 PM"}},{"Id":180,"Title":"Developers: Why Care About the User?","Abstract":"As developers, we deal with technologies, frameworks, and data, making it very easy to forget that what we create is meant for real people to use.\n\nWhile designers and UI specialists should handle most decisions about how a product or service looks and feels, we should all be on the same page to make better solutions. Whether we are building an interface for a desktop website, mobile application, or chatbot, what are some basic design concepts that we as developers can pick up, allowing us to be on the same page with designers and product owners during product meetings and discussions?\n","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":23,"Text":"Web"},{"Id":43,"Text":"FrontEnd"},{"Id":44,"Text":"Design"},{"Id":59,"Text":"User Experience"},{"Id":60,"Text":"UX"}],"Speaker":{"Id":94,"DisplayName":"Andrew Malek"},"TimeSlot":{"StartTime":"2017-10-13T18:00:00","EndTime":"2017-10-13T19:00:00","DisplayDateTime":"Friday, October 13 at 1:00 PM"}},{"Id":221,"Title":"The Challenge of the Voodoo Monkey: Surviving as a Developer in Corporate Realspace","Abstract":"In the business world, tech workers seem to be placed on a spectrum from unskilled keypuncher to practitioner of black magic that mere mortals can never understand though the truth lies somewhere in between. Facing those misconceptions can be difficult enough on their own, but for the countless developers working for companies in businesses other than software there are a variety of different problem domains to master, budgets to be justified, Senior Executive Assistant Vice Presidents to present to, and TPS reports to be filed. How can you satisfy the requirements of the work environment while keeping your skills sharp, learning new languages, getting ahead, or sometimes dodging enough restructuring efforts to simply stay employed? Good news! Other devs who have gone before have found some useful patterns and definite antipatterns for navigating the swirling waters of the corporate world and will make sure you get another copy of that memo.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":36,"Text":"Life Hacks"},{"Id":73,"Text":"Mental Health"},{"Id":95,"Text":"Culture"}],"Speaker":{"Id":117,"DisplayName":"Branden Schwartz"},"TimeSlot":{"StartTime":"2017-10-13T18:00:00","EndTime":"2017-10-13T19:00:00","DisplayDateTime":"Friday, October 13 at 1:00 PM"}},{"Id":230,"Title":"Mocking .NET Without Hurting Its Feelings","Abstract":"Unit testing has become an accepted part of our lives as .NET programmers. To help focus our tests to only the code we want to validate, Mocking Frameworks are a powerful tool in our toolbox.  Like many tools, if you have an understanding of how the tool works under the hood, you can bend it to your will (and also know where it'll break if you bend too much).\n\nIn this session, you'll learn about the two main types of mocking frameworks: constrained frameworks (like RhinoMocks and Moq) and unconstrained frameworks (such as Typemock Isolator and Telerik JustMock).  I'll dig into how the two actually do their magic and we'll discuss the pros, cons, and limits of both. We'll look at examples of how to use the frameworks in your tests, mocking out dependencies from your own code and even third-party logic.\n\nYou'll get the most out of this session if you're comfortable reading C# code and have a general understanding of class inheritance in .NET, along with some experience writing and running unit tests. Prior experience using mocking frameworks is not necessary.\n","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":28,"Text":"Testing"},{"Id":110,"Text":".Net"}],"Speaker":{"Id":119,"DisplayName":"John M. Wright"},"TimeSlot":{"StartTime":"2017-10-13T18:00:00","EndTime":"2017-10-13T19:00:00","DisplayDateTime":"Friday, October 13 at 1:00 PM"}},{"Id":139,"Title":"GameDev for Business Developers","Abstract":"With the rise of engines like Unity, the languages and tools available for game development often overlap with those used in web and desktop development. Conceptually, however, it's a completely different world. We'll discuss some of the key differences to help ease the transition into the world of hobbyist game development.","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":97,"Text":"GameDev"}],"Speaker":{"Id":73,"DisplayName":"Dylan Wolf"},"TimeSlot":{"StartTime":"2017-10-13T19:30:00","EndTime":"2017-10-13T20:30:00","DisplayDateTime":"Friday, October 13 at 2:30 PM"}},{"Id":161,"Title":"Intro to Kubernetes","Abstract":"It seems like everyone is talking about Kubernetes these days, but it is such a flexible tool, it can be tough for a beginner to get started.  This talk will help you cut through all the jargon, show you exactly what Kubernetes buys you and what you trade off, and demonstrate taking a system from nothing to a working app.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":55,"Text":"Microservices"},{"Id":109,"Text":"Docker"},{"Id":112,"Text":"Kubernetes"}],"Speaker":{"Id":87,"DisplayName":"Karl Bielefeldt"},"TimeSlot":{"StartTime":"2017-10-13T19:30:00","EndTime":"2017-10-13T20:30:00","DisplayDateTime":"Friday, October 13 at 2:30 PM"}},{"Id":212,"Title":"Giving Clarity to LINQ Queries by Extending Expressions","Abstract":"In this session we'll learn about .Net Expression trees by discovering how they work and applying the knowledge to LINQ using the pipes and filters pattern.\nLINQ and Entity Framework are both commonly used in the .Net ecosystem, but even well-written applications can have LINQ queries that are difficult to understand. Because LINQ is so flexible, it can be written in ways that fail to communicate the developer’s intent. Well-written LINQ should be so clear as to be self-documenting. To write clear LINQ, it helps to understand the details of a few LINQ components that improve LINQ’s readability.\n\nWe’ll be showing how to use a pipe and filter pattern to make LINQ queries easier to comprehend. We will take a deep dive into expression trees to understand how they work, and how to manipulate them for maximum re-usability.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":3,"Text":"Advanced"},{"Id":24,"Text":"Clean Code"},{"Id":41,"Text":"C#"},{"Id":53,"Text":"Functional Programming"},{"Id":56,"Text":"Patterns"},{"Id":110,"Text":".Net"},{"Id":115,"Text":"ORM"}],"Speaker":{"Id":111,"DisplayName":"Ed Charbeneau"},"TimeSlot":{"StartTime":"2017-10-13T19:30:00","EndTime":"2017-10-13T20:30:00","DisplayDateTime":"Friday, October 13 at 2:30 PM"}},{"Id":220,"Title":"Set Up Your Own Prerender Service with AWS OpsWorks","Abstract":"Do you have a web page that can’t be rendered without a real, Javascript-enabled browser, but you need Google to index it? Prerender helps you do exactly that. You could use the paid subscription service provided by Prerender.io, but why not just host the open source server yourself in AWS? Let me show you how easy it is to set it up on your own scalable Node.js cluster using OpsWorks.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":13,"Text":"DevOps"},{"Id":63,"Text":"AWS"},{"Id":136,"Text":"Node.js"}],"Speaker":{"Id":115,"DisplayName":"Jacob Senecal"},"TimeSlot":{"StartTime":"2017-10-13T19:30:00","EndTime":"2017-10-13T20:30:00","DisplayDateTime":"Friday, October 13 at 2:30 PM"}},{"Id":234,"Title":"TensorFlow for People without (or with!) a Ph.D.","Abstract":"Writing code for machine learning algorithms is not and easy task.  TensorFlow attempts to make that easier and more understandable.  By representing machine learning workflows as a graph, it tries to capture the actual biological processes of the brain.  This session will look at TensorFlow from an beginner's perspective.  It will avoid math where possible and instead focus on getting into the process quickly by taking advantage of the abstractions provided by the framework.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":31,"Text":"Machine Learning"},{"Id":67,"Text":"Python"},{"Id":139,"Text":"tensorflow"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2017-10-13T19:30:00","EndTime":"2017-10-13T20:30:00","DisplayDateTime":"Friday, October 13 at 2:30 PM"}},{"Id":118,"Title":"Innovating when your work is suffocating!","Abstract":"This is a high-energy, high-content program designed for technical teams who need to implement solutions for complex or uncertain environments. Now more than ever, business is dependent upon technology to deliver products quickly, driving even greater need for business acumen, innovative thinking and experimentation.\n\nThis program is designed to strengthen strategic and business management expertise in your leadership and technical staff. After this career-changing event your team will:\n•\tUnderstand the Competing Values Framework and recognize the predominant culture impacting you & your team\n•\tLearn the behaviors that will help you be more effective in your organization’s culture\n•\tDevelop a model of delivery that brings the business and technical staff to the table together to focus on business value without burnout or a death march to the deadline\n•\tCall out and eliminate the “elephants in the bushes” that derail many strategic projects\n","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":33,"Text":"Career"},{"Id":34,"Text":"Personal Growth"},{"Id":35,"Text":"Leadership"},{"Id":50,"Text":"Keynote"},{"Id":95,"Text":"Culture"}],"Speaker":{"Id":68,"DisplayName":"Joanne"},"TimeSlot":{"StartTime":"2017-10-13T21:00:00","EndTime":"2017-10-13T22:00:00","DisplayDateTime":"Friday, October 13 at 4:00 PM"}},{"Id":197,"Title":"Custom Middleware & Microservices with ASP.NET Core","Abstract":"At the core of ASP.NET Core is Microsoft’s implementation of the OWIN standard, giving developers full control over the ASP.NET pipeline. In this session I will explain what OWIN is and how it can empower you to quickly and easily reconfigure an entire web application. Now in full control, you can do everything from injecting custom code (middleware) into any stage of the pipeline to running lightweight applications and microservices without MVC.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":55,"Text":"Microservices"},{"Id":110,"Text":".Net"},{"Id":126,"Text":"ASP.NET Core"}],"Speaker":{"Id":64,"DisplayName":"Ondrej Balas"},"TimeSlot":{"StartTime":"2017-10-13T21:00:00","EndTime":"2017-10-13T22:00:00","DisplayDateTime":"Friday, October 13 at 4:00 PM"}},{"Id":226,"Title":"Kotlin and the next steps for Android Development","Abstract":"Kotlin is the new hotness in the world of Android! The language has grown in popularity, and is now officially supported by Google. I will cover the advance usage and design patterns of the language for Android development. I will then go over my own experience, trials, and tribulations, and help you answer questions your team/company might ask about adopting it.\n\nIf you are not already using Kotlin you might be wondering why and how to adopt it.\n\n","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":3,"Text":"Advanced"},{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"},{"Id":117,"Text":"android"},{"Id":119,"Text":"kotlin"}],"Speaker":{"Id":78,"DisplayName":"Andrew May"},"TimeSlot":{"StartTime":"2017-10-13T21:00:00","EndTime":"2017-10-13T22:00:00","DisplayDateTime":"Friday, October 13 at 4:00 PM"}},{"Id":246,"Title":"5 ways to better dev, no matter what!","Abstract":"A review of five development principles and practices: domain driven design, test driven development, static analysis, and automation/continuous integration.  Includes discussion on a real life applications, how it applies to my team's tech stack, and tools used to automate these things.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":10,"Text":"TDD"},{"Id":24,"Text":"Clean Code"},{"Id":28,"Text":"Testing"},{"Id":51,"Text":"Best Practicies"},{"Id":142,"Text":"Continual Integration"}],"Speaker":{"Id":80,"DisplayName":"Angelina Uno-Antonison"},"TimeSlot":{"StartTime":"2017-10-13T21:00:00","EndTime":"2017-10-13T22:00:00","DisplayDateTime":"Friday, October 13 at 4:00 PM"}},{"Id":268,"Title":"Increasing your Coding Speed in SQL Server Management Studio 2017","Abstract":"Every developer wants to be productive and get more things accomplished during their day to day work. Given a choice between working harder and working smarter, you will most likely choose the latter. But the big question is – How do you boost your productivity? How do you reduce your development time? How do you increase your coding speed? Gaining a superlative understanding of the IDE goes a long way in increasing one’s productivity. In this session, you will learn a number of tips and tricks which will enhance your productivity and efficiency in SSMS IDE. We will explore ways to stop doing manual repetitive tasks, use shortcuts, type less and generate more lines of code in minimal time. This will be a content rich session with plenty of live demos. By the end of this session, you will learn some useful techniques to take back with you and apply in your day to day work.","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":29,"Text":"Database"},{"Id":114,"Text":"SQLServer"},{"Id":141,"Text":"Productivity"}],"Speaker":{"Id":71,"DisplayName":"Samir Behara"},"TimeSlot":{"StartTime":"2017-10-13T21:00:00","EndTime":"2017-10-13T22:00:00","DisplayDateTime":"Friday, October 13 at 4:00 PM"}},{"Id":135,"Title":"Can GitLab Build it? YES IT CAN!","Abstract":"Continuous integration:  we all know we should use it, but for small projects it can be a lot of hassle and overhead to get set up. What if there were a way to make CI simple even for the smallest projects? GitLab CI provides a way to embed build testing from the very start of a project and have the system grow with your project. Come learn how to bootstrap your CI system using GitLab CI.\n","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":16,"Text":"Build"}],"Speaker":{"Id":22,"DisplayName":"Jonathan Creekmore"},"TimeSlot":{"StartTime":"2017-10-14T13:00:00","EndTime":"2017-10-14T14:00:00","DisplayDateTime":"Saturday, October 14 at 8:00 AM"}},{"Id":177,"Title":"SQL Server on Linux","Abstract":"In March 2016, Microsoft surprised nearly everybody by announcing that they were porting SQL Server to Linux.  After numerous preview versions, this is set to become a reality with the 14.0 release in the summer of 2017.  We'll discuss how you can benefit from this move and what functionality this initial release does and does not include.  We will also talk about some of the new features in SQL Server that make it a more compelling product than ever.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":29,"Text":"Database"},{"Id":114,"Text":"SQLServer"}],"Speaker":{"Id":93,"DisplayName":"Allison Benneth"},"TimeSlot":{"StartTime":"2017-10-14T13:00:00","EndTime":"2017-10-14T14:00:00","DisplayDateTime":"Saturday, October 14 at 8:00 AM"}},{"Id":179,"Title":"Why Nobody Fills Out My Forms","Abstract":"Has your web form conversion rate hit a wall? Are users not receiving confirmation e-mails, getting pestered with password or data format warnings *after* they finish entering their information, or bailing after being asked the same questions multiple ways? Find out why not enough people are filling out your web forms, and learn suggestions of A/B tests you can try to help encourage more people to interact.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":43,"Text":"FrontEnd"},{"Id":44,"Text":"Design"},{"Id":59,"Text":"User Experience"},{"Id":60,"Text":"UX"},{"Id":65,"Text":"Mobile"}],"Speaker":{"Id":94,"DisplayName":"Andrew Malek"},"TimeSlot":{"StartTime":"2017-10-14T13:00:00","EndTime":"2017-10-14T14:00:00","DisplayDateTime":"Saturday, October 14 at 8:00 AM"}},{"Id":216,"Title":"Fishing Instructor 101 - Being an Effective Mentor","Abstract":"When learning a new technology, it's easy to spend hours or days mired in the vagaries and pitfalls of that technology, banging your head against the wall until you finally stumble upon the magical incantation that finally \"just works.\" I call this \"Learning by Concussion.\"\n\nIf you're a member of a team, it would be silly and wasteful for the others to have to go through the same exercise in futility. So you decide to teach them!\n\nHowever, teaching is as much a skill as writing good code. But once you've gotten then hang of it, mentoring can be one of the most rewarding experiences life. Join me as I share some of the tips I've learned about effective mentoring in our field so that you, too, can save those around you from needless head injuries!","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":35,"Text":"Leadership"}],"Speaker":{"Id":114,"DisplayName":"Craig Burton"},"TimeSlot":{"StartTime":"2017-10-14T13:00:00","EndTime":"2017-10-14T14:00:00","DisplayDateTime":"Saturday, October 14 at 8:00 AM"}},{"Id":257,"Title":"Introduction to Graph Databases with Neo4J","Abstract":"This talk will provide you an introduction to graph databases. What can you do with them? How do you model one? How do you get data in and out? How are they different from relational database systems? This talk will focus on Neo4J and its implementation of a labeled property graph database and the Cypher query language.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":29,"Text":"Database"},{"Id":68,"Text":"Data Science"},{"Id":77,"Text":"Big Data"},{"Id":144,"Text":"GraphDB"}],"Speaker":{"Id":81,"DisplayName":"Brant Boehmann"},"TimeSlot":{"StartTime":"2017-10-14T13:00:00","EndTime":"2017-10-14T14:00:00","DisplayDateTime":"Saturday, October 14 at 8:00 AM"}},{"Id":140,"Title":"FSGD and the Art of Delivering Value","Abstract":"When shipping software, there is a constant battle between going fast and doing it right. Add to the mix the fact that coordination across teams and departments comes at a high transaction cost. How can we minimize the friction?\n\nAt LeanKit, we strive to continuously improve our processes across the entire organization. Along the way, we developed FSGD, which we affectionately pronounce \"fizz good.\" FSGD is our thinking tool for shipping Frequent, Small, Good, and Decoupled value.\n\nIn this talk, I'll share with you the challenges we faced as we scaled, how we struggled, what we learned, and how we're evolving. The goal is for you to walk away with tools and practical processes that will impact you and your team's success.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":6,"Text":"Scrum"},{"Id":7,"Text":"Kanban"},{"Id":8,"Text":"Agile"},{"Id":9,"Text":"Methodology"},{"Id":13,"Text":"DevOps"},{"Id":25,"Text":"Code Review"},{"Id":28,"Text":"Testing"},{"Id":35,"Text":"Leadership"},{"Id":95,"Text":"Culture"}],"Speaker":{"Id":2,"DisplayName":"David Neal"},"TimeSlot":{"StartTime":"2017-10-14T14:30:00","EndTime":"2017-10-14T15:30:00","DisplayDateTime":"Saturday, October 14 at 9:30 AM"}},{"Id":150,"Title":"Using Docker for Development and Production","Abstract":"Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications, whether on laptops, data center VMs, or the cloud. \n We are going to explore how we can leverage Docker for use while we develop our applications as well as once we are ready to deploy. We will discuss creating a container that will allow us to work on our .NET Core application in a way that incorporates live rebuilds, debugging, and continuous testing.  \n Once we have our development environment configured we will turn our attention to deployment. The reasons we would want to use Docker in production are plentiful. Benefits include but are not limited to application scalability and consistency in deployment configuration across environments.","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":13,"Text":"DevOps"},{"Id":109,"Text":"Docker"}],"Speaker":{"Id":79,"DisplayName":"Clayton Hunt"},"TimeSlot":{"StartTime":"2017-10-14T14:30:00","EndTime":"2017-10-14T15:30:00","DisplayDateTime":"Saturday, October 14 at 9:30 AM"}},{"Id":173,"Title":"Kotlin: What’s in it For You","Abstract":"Who hates Java?  Maybe that’s a little harsh but who really likes it?  Java is a great idea but the anachronisms of the language begin to get in the way.  But Java is so widespread can you afford to ignore it?  If you learn Kotlin, you can.  Kotlin targets the JVM while affording developers advancements found in many modern languages while still leveraging existing legacy Java code.  (Finally, operator overloading!)  And Kotlin is the real deal too.  It’s been used in production for year but will be officially supported by Google in the next release of Android Studio.  Kotlin is coming and it’s time to get ready to meet it!","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":117,"Text":"android"},{"Id":119,"Text":"kotlin"},{"Id":120,"Text":"jvm"}],"Speaker":{"Id":54,"DisplayName":"Douglas Starnes"},"TimeSlot":{"StartTime":"2017-10-14T14:30:00","EndTime":"2017-10-14T15:30:00","DisplayDateTime":"Saturday, October 14 at 9:30 AM"}},{"Id":195,"Title":"ASP.NET MVC Core: A Breath of Fresh Air in a JavaScript Fatigued World","Abstract":"Have you found that using JavaScript for full stack development is more complicated than it should be? Are you tired of mastering \"the\" framework of the day only to find out that it has been replaced by another?\n\nMicrosoft has created a very strong alternative to website development for everyone, startup to enterprise. MVC 6 in ASP.NET Core provides rapid website and API development that runs on multiple platforms. This talk will show some of the great new features in MVC Core that provide a compelling argument for server-side or mixed server-client development.\n\nThis talk will cover new features in the MVC Core Razor view engine including:\n\nReusability with View Components\nDependency Injection for Testing & Separation of Concerns\nCleaner Markup with Tag Helpers","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":23,"Text":"Web"},{"Id":41,"Text":"C#"},{"Id":110,"Text":".Net"},{"Id":126,"Text":"ASP.NET Core"},{"Id":127,"Text":"MVC"}],"Speaker":{"Id":98,"DisplayName":"Stuart Dickerson"},"TimeSlot":{"StartTime":"2017-10-14T14:30:00","EndTime":"2017-10-14T15:30:00","DisplayDateTime":"Saturday, October 14 at 9:30 AM"}},{"Id":253,"Title":"Machine Learning on Apple Devices","Abstract":"This year, Apple announced the CoreML framework for third-party developers. CoreML allows developers to easily utilize trained machine learning models in their apps whereas previously you had to be a guru with tools like Metal, Accelerate, or OpenCV. In this talk, we’ll retrace the steps taken by an iOS developer to learn the basics of machine learning. We'll also look at the CoreML framework, Vision APIs, and other considerations you need to make when incorporating machine learning into your apps.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":30,"Text":"AI"},{"Id":31,"Text":"Machine Learning"},{"Id":65,"Text":"Mobile"},{"Id":116,"Text":"ios"}],"Speaker":{"Id":116,"DisplayName":"Jarrod Parkes"},"TimeSlot":{"StartTime":"2017-10-14T14:30:00","EndTime":"2017-10-14T15:30:00","DisplayDateTime":"Saturday, October 14 at 9:30 AM"}},{"Id":145,"Title":"HoloLens Mixed Reality for Fun & Profit","Abstract":"What innovations are the current generation of mixed reality devices capable of providing? Lets explore what a commercial augmented reality solution might look like using the Microsoft HoloLens and how you can get started building real business solutions.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":102,"Text":"augmented reality"},{"Id":103,"Text":"mixed reality"},{"Id":104,"Text":"windows holographic"},{"Id":105,"Text":"virtual reality"}],"Speaker":{"Id":36,"DisplayName":"Gaines Kergosien"},"TimeSlot":{"StartTime":"2017-10-14T16:00:00","EndTime":"2017-10-14T17:00:00","DisplayDateTime":"Saturday, October 14 at 11:00 AM"}},{"Id":176,"Title":"Modern Agile: Rebuilding Agile from first principles. Agile for all disciplines.","Abstract":"Modern agile methods are defined by four guiding principles:\n\n- Make people awesome\n- Make safety a prerequisite\n- Experiment and learn rapidly\n- Deliver value continuously\n\nNote that these principles are not just for software developers.\n\nMany teams struggle today trying to fit Agile practices into their business. The methodologies developed for software do a poor job of integrating with the complexities cross-functional teams.\n\nAs businesses have struggled, they have turned to consultants and certifications for cookie-cutter \"best-practices\" that often don't fit your organization.\n\nThe solution is to rebuild our understanding of Agile from first-principles so we can build solutions that are tailored to work for us.\n\nScrap the Scrum off your shoes and join us in the collaborative discussion on how to use Modern Agile principles to \"Be Agile\" and not just \"Do Agile\"\n","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":8,"Text":"Agile"}],"Speaker":{"Id":92,"DisplayName":"Daniel Heater"},"TimeSlot":{"StartTime":"2017-10-14T16:00:00","EndTime":"2017-10-14T17:00:00","DisplayDateTime":"Saturday, October 14 at 11:00 AM"}},{"Id":178,"Title":"Learning to Think in Sets","Abstract":"Many database systems are optimized to process data in sets.  This can be a very different paradigm to developers who are used to writing code that operates on data row-by-row.  We will discuss common anti-patterns that break set-based functionality, and then walk through ways to fix these issues.  You may be surprised at how dramatically improved performance can be for solutions that implement set-based thinking.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":29,"Text":"Database"},{"Id":72,"Text":"Big Picture"}],"Speaker":{"Id":93,"DisplayName":"Allison Benneth"},"TimeSlot":{"StartTime":"2017-10-14T16:00:00","EndTime":"2017-10-14T17:00:00","DisplayDateTime":"Saturday, October 14 at 11:00 AM"}},{"Id":236,"Title":"Lift: The Simply Functional Web Framework","Abstract":"Ten years after its first release, Lift is still the most powerful, most secure web framework available today. By design Lift makes building secure web applications the happy path while maximizing both developer and web designer productivity. \n \nBy the end of this presentation, the audience will know how to bootstrap a new web application with LIft quickly from scratch utilizing the basic features of the framework. In addition to knowing how to get started, you will also know how to ship a Lift application into production on modern cloud platforms ranging from AWS to Heroku. Throughout the presentation, we will discuss tradeoffs of using Lift over other alternatives. \n","Room":"Ballroom 1","SessionLength":60,"Tags":[],"Speaker":{"Id":56,"DisplayName":"Joe Barnes"},"TimeSlot":{"StartTime":"2017-10-14T16:00:00","EndTime":"2017-10-14T17:00:00","DisplayDateTime":"Saturday, October 14 at 11:00 AM"}},{"Id":250,"Title":"Values Drive Development","Abstract":"How we develop and ship software expresses the values of our team, business & users. Many teams can't state their driving values. The process of outlining a shared set of values can lead to enhanced team identity and help align development efforts. The inverse of this process is looking at what the team has done historically and working backward from that to find the implicit values that have driven team behavior. If we study how we spend time, money and energy, we can cultivate a picture of our values in practice. There will be a gap or dissonance between our self professed values and those visible to others from our actions. Embracing this dissonance can drive out more clarity, coherence and transparency in our future efforts.","Room":"Ballroom 2","SessionLength":60,"Tags":[],"Speaker":{"Id":124,"DisplayName":"Alan Stevens"},"TimeSlot":{"StartTime":"2017-10-14T16:00:00","EndTime":"2017-10-14T17:00:00","DisplayDateTime":"Saturday, October 14 at 11:00 AM"}},{"Id":159,"Title":"Putting your builds to work for you, a piece of Cake!","Abstract":"Build tools don't always get the attention they deserve.  Tools like TeamCity and Jenkins allow users to easily create builds with a user interface.  However, your build logic is tied to your CI server.  Tools like Cake allow  you to decouple your builds from your build server and also provide the advantage that you can run the build locally, which is great. Let us consider the build server debugging dance of commit, wait, fail, commit, wait, fail, commit, wait, success.  With a build that runs locally that cycle is shortened because you can run it locally and you have a working build on every commit. In addition to these benefits, Cake uses C# and the .NET framework , putting thousands of libraries easily in reach for creating plugins to elevate your builds to another layer.  We will explore build tools, focusing on Cake.   You will be introduced to the Cake DSL, the basic build file, and the addin structure for Cake, and we may even build an addin.\n","Room":"Ballroom 5","SessionLength":30,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":13,"Text":"DevOps"},{"Id":16,"Text":"Build"},{"Id":41,"Text":"C#"},{"Id":110,"Text":".Net"}],"Speaker":{"Id":83,"DisplayName":"Jamie Phillips"},"TimeSlot":{"StartTime":"2017-10-14T18:00:00","EndTime":"2017-10-14T18:30:00","DisplayDateTime":"Saturday, October 14 at 1:00 PM"}},{"Id":200,"Title":"Use machine learning to find your next job","Abstract":"Many practical problems can be solved using data. In this talk, you’ll learn how to go from problem to solution using a few programming and machine learning techniques. We’ll talk about asking the right question, gathering data, and analyzing it to solve a practical problem.","Room":"Ballroom 1","SessionLength":30,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":31,"Text":"Machine Learning"},{"Id":33,"Text":"Career"},{"Id":67,"Text":"Python"},{"Id":68,"Text":"Data Science"}],"Speaker":{"Id":102,"DisplayName":"Samuel Taylor"},"TimeSlot":{"StartTime":"2017-10-14T18:00:00","EndTime":"2017-10-14T18:30:00","DisplayDateTime":"Saturday, October 14 at 1:00 PM"}},{"Id":204,"Title":"Why Your DBA hates your ORM","Abstract":"A high percentage of software developers, especially those using web technologies prefer to use Object Relational Mappers (ORMS) instead of directly using SQL to access a relational database. Many DBAs have pretty serious objections to the practice, objections that you have to overcome as a developer in order to make your job easier. We'll discuss these objections and how to overcome them so that both you and your DBA will be happy with your choice. We will keep this as database and language-agnostic as possible.","Room":"Ballroom 2","SessionLength":30,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":4,"Text":"Soft Skills"},{"Id":29,"Text":"Database"},{"Id":84,"Text":"Backend"},{"Id":115,"Text":"ORM"}],"Speaker":{"Id":105,"DisplayName":"William Gant"},"TimeSlot":{"StartTime":"2017-10-14T18:00:00","EndTime":"2017-10-14T18:30:00","DisplayDateTime":"Saturday, October 14 at 1:00 PM"}},{"Id":207,"Title":"Are we being programmed by our own software?","Abstract":"Let’s take a hard look in the mirror and talk about how our own software has inadvertently reprogrammed the way we think, build and use technology. Once we can accept this idea then we can start to see a symbiotic relationship between the software we build and how we build software. Finally, let’s look into the future of software development and technology to see where changes could come next.","Room":"Ballroom 3","SessionLength":30,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":44,"Text":"Design"},{"Id":54,"Text":"Architecture"},{"Id":59,"Text":"User Experience"},{"Id":72,"Text":"Big Picture"},{"Id":113,"Text":"Conversations"},{"Id":132,"Text":"Futuristic"}],"Speaker":{"Id":99,"DisplayName":"Todd Merritt"},"TimeSlot":{"StartTime":"2017-10-14T18:00:00","EndTime":"2017-10-14T18:30:00","DisplayDateTime":"Saturday, October 14 at 1:00 PM"}},{"Id":240,"Title":"Blockchain all the Things","Abstract":"Blockchains have been making headlines lately. Various industries and governments are turning to them for answers. Will blockchains overhaul industry, government, and the internet?\n\nNo one knows for sure, but if you attend this talk, you can walk away with a foundation in blockchain theory, and an understanding of how blockchains can be used to build more secure and resilient systems.\n\nThis is a technical talk that will dive into the details of blockchains, and will look at how they are being applied in the real world.\n","Room":"Ballroom 4","SessionLength":30,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":124,"Text":"INTERNET"},{"Id":145,"Text":"blockchain"},{"Id":146,"Text":"distributed systems"}],"Speaker":{"Id":121,"DisplayName":"Eric Lang"},"TimeSlot":{"StartTime":"2017-10-14T18:00:00","EndTime":"2017-10-14T18:30:00","DisplayDateTime":"Saturday, October 14 at 1:00 PM"}},{"Id":128,"Title":"Virtual Reality with Azure and Unity","Abstract":"In this session we will create:\n \n • A Windows IoT Core device with sensors streaming to Microsoft Azure \n \n • Azure IoT Hub forwarding the data to Stream Analytics \n \n • Stream Analytics collecting the data and moving it to a ASP.NET SignalR instance. \n \n • Unity engine consuming the SignalR data for realtime data feed in a game. \n \n The goal being very simple. Get Windows IoT Core devices streaming to Unity game and create a Augmented Reality interactive experience.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":20,"Text":"IoT"},{"Id":21,"Text":"Windows IoT Core"},{"Id":22,"Text":"Raspberry Pi"},{"Id":41,"Text":"C#"}],"Speaker":{"Id":72,"DisplayName":"JaredRhodes"},"TimeSlot":{"StartTime":"2017-10-14T19:00:00","EndTime":"2017-10-14T20:00:00","DisplayDateTime":"Saturday, October 14 at 2:00 PM"}},{"Id":141,"Title":"Unlocking JavaScript via TypeScript","Abstract":"Maybe you are using fat arrows and the class keyword, but do you know when best to use const vs let? What about the rest and spread operator? Are you taking advantage of destructing? And maybe you have heard of proxies, generators, and decorators, but have no idea when you would ever use them? Well in this session is certainly for you. We will use TypeScript as the bridge to unlock the full potential of all the new features in JavaScript that aren't fully available, but ones that can transform how you write code and make you more productive.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":99,"Text":"javascript"},{"Id":100,"Text":"typescript"}],"Speaker":{"Id":74,"DisplayName":"Josh"},"TimeSlot":{"StartTime":"2017-10-14T19:00:00","EndTime":"2017-10-14T20:00:00","DisplayDateTime":"Saturday, October 14 at 2:00 PM"}},{"Id":147,"Title":"Building A Developer Community In Your Workplace","Abstract":"Development communities are growing like crazy.  In any given city, you have meetups, hackathons, conferences, and so much more.  This is great for expanding knowledge after work hours, but how about inside your workplace?  There’s a wealth of wisdom among your colleagues, just waiting to be shared.  In this talk, we’ll learn different initiatives you can take to create a community-oriented environment.  We’ll cover different ways to collaborate, share information, and write code that influence your very own workplace community.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":4,"Text":"Soft Skills"},{"Id":34,"Text":"Personal Growth"},{"Id":95,"Text":"Culture"},{"Id":107,"Text":"Community"}],"Speaker":{"Id":66,"DisplayName":"Pat Viafore"},"TimeSlot":{"StartTime":"2017-10-14T19:00:00","EndTime":"2017-10-14T20:00:00","DisplayDateTime":"Saturday, October 14 at 2:00 PM"}},{"Id":167,"Title":"Unit Testing SQL Server","Abstract":"In the nearly 20 years I have been working with SQL Server, most of that as an independent consultant, I can count on two hands the number of clients I have come across that had ANY database tests constructed.  I can count on TWO FINGERS the number of them that had repeatable database tests.  Even the most ardent Agile/Scrum/pick-your-new-and-shiny-development-mantra shops hardly ever do anything more than wave a magic wand at testing the database, because it can be REALLY HARD to do and do correctly.  In this session we will cover examples of why repeatable database testing is CRITICALLY important and then examine both a free and a low-cost commercial product to ease the pain and improve developer efficiency.","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":28,"Text":"Testing"},{"Id":114,"Text":"SQLServer"}],"Speaker":{"Id":88,"DisplayName":"TheSQLGuru"},"TimeSlot":{"StartTime":"2017-10-14T19:00:00","EndTime":"2017-10-14T20:00:00","DisplayDateTime":"Saturday, October 14 at 2:00 PM"}},{"Id":245,"Title":"See Your Data on the Network with Wireshark","Abstract":"If your program sends data over the network, then you may someday need to know what it looks like on the network.  When debugging, it is often useful to know exactly what data your program is sending and receiving.  This presentation will give you a quick refresher (or fast introduction) to basic networking protocols, explain how to use Wireshark to see your data and how to use Wireshark Generic Descriptor to define custom protocols.\n\nNetworking Refresher:  Brief review of basic networking, standard protocols (IP, TCP, UDP, etc.) and how the networking model uses this layers to build messages.\n\nWireshark Overview and Demo:  After a brief overview of how to use Wireshark, we will look at some of examples of data captures to learn how to see data on the network.\n\nWireshark Generic Descriptor (WSGD):  If you have a custom protocol, you will need to define it so that Wireshark can display the data.  We will look at how to define a protocol using WSGD and then look at examples of Wireshark displaying data in custom protocols.\n","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":123,"Text":"NETWORKING"}],"Speaker":{"Id":31,"DisplayName":"Wayne Goode"},"TimeSlot":{"StartTime":"2017-10-14T19:00:00","EndTime":"2017-10-14T20:00:00","DisplayDateTime":"Saturday, October 14 at 2:00 PM"}},{"Id":138,"Title":"Finishing Your Unity Game","Abstract":"For game jammers and hobbyist devs, the process of releasing a game may seem like an afterthought compared to designing and building it--right up until you realize everything you need to do before you can finally click \"Build\" or \"Submit\". This session will cover the easy-to-forget steps and last-minute decisions so you can plan ahead.","Room":"Ballroom 1","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":65,"Text":"Mobile"},{"Id":97,"Text":"GameDev"},{"Id":98,"Text":"Unity"}],"Speaker":{"Id":73,"DisplayName":"Dylan Wolf"},"TimeSlot":{"StartTime":"2017-10-14T20:30:00","EndTime":"2017-10-14T21:30:00","DisplayDateTime":"Saturday, October 14 at 3:30 PM"}},{"Id":201,"Title":"Getting Specific: Component Based Styling","Abstract":"With the introduction of modular javascript and powerful bundler like webpack the web has never been the same. Styling has long been debated, but finally with these advancements we can scope our styles at multiple levels. Equip yourself with the knowledge to make the right decisions.","Room":"Ballroom 5","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":23,"Text":"Web"},{"Id":43,"Text":"FrontEnd"},{"Id":44,"Text":"Design"}],"Speaker":{"Id":104,"DisplayName":"Kyle Welch"},"TimeSlot":{"StartTime":"2017-10-14T20:30:00","EndTime":"2017-10-14T21:30:00","DisplayDateTime":"Saturday, October 14 at 3:30 PM"}},{"Id":223,"Title":"When Thermal Refactoring Isn't An Option: Triage, Salvage, and Duct Tape Engineering","Abstract":"Developers often find themselves on the maintenance end of inherited applications of variable quality. Sometimes features need to be implemented on aggressive timelines, at others a fix needs to go out immediately with very little wiggle room. Many developers are comfortable with greenfield projects but haven’t practiced the skills required to troubleshoot and resolve issues quickly, particularly when the applications involved are shining examples of antipatterns in the wild. This talk will focus on the mindset a developer needs to survive in a world of development gone wrong and encourage active discussion using real examples of “exceptional” code that’s best navigated with a strong stomach when burning it down and starting fresh is not an option.","Room":"Ballroom 2","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":2,"Text":"Intermediate"},{"Id":36,"Text":"Life Hacks"},{"Id":110,"Text":".Net"},{"Id":114,"Text":"SQLServer"}],"Speaker":{"Id":117,"DisplayName":"Branden Schwartz"},"TimeSlot":{"StartTime":"2017-10-14T20:30:00","EndTime":"2017-10-14T21:30:00","DisplayDateTime":"Saturday, October 14 at 3:30 PM"}},{"Id":225,"Title":"Android MVP - Understanding the Newest Android Design Pattern","Abstract":"Android, and mobile in general is a fast paced moving target. Things change, but no one knows what’s going on. We will discuss the newest pattern that the folks over at Google have adopted and will develop a simple app natively on Android while discussing the PROs and CONs of Android Patterns.\n\nWhile I live code an application on screen with everyone watching with the newest pattern for Android (MVP) I’ll discuss this pattern while discussing past patterns and where the Android platform is headed. Hopefully everyone can all learn a bit about Android, and where the mobile patterns are headed in general.\n\nCome see me while I take questions, talk, and code. I’ll be sweating bullets, making something fun and quick for everyone to enjoy while being entertaining. At least I hope so! If not, drinks are on me!","Room":"Ballroom 4","SessionLength":60,"Tags":[{"Id":1,"Text":"Beginner"},{"Id":51,"Text":"Best Practicies"},{"Id":65,"Text":"Mobile"},{"Id":117,"Text":"android"}],"Speaker":{"Id":78,"DisplayName":"Andrew May"},"TimeSlot":{"StartTime":"2017-10-14T20:30:00","EndTime":"2017-10-14T21:30:00","DisplayDateTime":"Saturday, October 14 at 3:30 PM"}},{"Id":232,"Title":"Building a low-cost, scalable, and fault-tolerant web application in the Cloud using AWS","Abstract":"This talk will cover the architecture behind projects, as well as demonstrating some of the benefits of these cloud services.  Cloud hosting can provide “pay what you use” plan ideal for projects with low or variable budget needs that can easily scale in minutes.  Elastic and fault-tolerant systems can be designed for failure, so if one or more resource go down, the system can recover with little or no down time.  Services covered include S3, EC2, DynamoDb, Rds, Lamda,  Auto-scaling, and Cloudformation.","Room":"Ballroom 3","SessionLength":60,"Tags":[{"Id":2,"Text":"Intermediate"},{"Id":13,"Text":"DevOps"},{"Id":20,"Text":"IoT"},{"Id":63,"Text":"AWS"},{"Id":123,"Text":"NETWORKING"},{"Id":137,"Text":"Cloud"}],"Speaker":{"Id":28,"DisplayName":"Chris Smeal"},"TimeSlot":{"StartTime":"2017-10-14T20:30:00","EndTime":"2017-10-14T21:30:00","DisplayDateTime":"Saturday, October 14 at 3:30 PM"}},{"Id":267,"Title":"Closing Session","Abstract":"Join us as we close the Open Spaces, give away some door prizes, and give DevSpace 2017 a proper send off.","Room":"Ballroom 3","SessionLength":60,"Tags":[],"Speaker":{"Id":1,"DisplayName":"Chris Gardner"},"TimeSlot":{"StartTime":"2017-10-14T21:45:00","EndTime":"2017-10-14T22:30:00","DisplayDateTime":"Saturday, October 14 at 4:45 PM"}}]