[{"Id":874,"Title":"A Manifesto in Hiring","Abstract":"This is a checklist that every leader in an organization needs to check out to be successful in scaling their company when it comes to hiring.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":40,"Text":"Non-Technical : Job Placement"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":378,"Text":"Technical"},{"Id":419,"Text":"hiring"}],"Speaker":{"Id":130,"DisplayName":"Taylor Desseyn"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":900,"Title":"ActivityPub, Mastodon, and the Fediverse","Abstract":"The great #twittermigration is underway, as people leave Twitter for Mastodon. But, really, what’s interesting about that!? Well, underpinning Mastodon is a networking protocol— ActivityPub. And that can make some pictures of other people’s lunches more interesting.  ActivityPub does more than enable Mastodon. ActivityPub interconnects the entire social media Fediverse, slightly but fundamentally changing how social media networks operate.  Come find out how you can run your own little corner of the Fediverse on ActivityPub.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":30,"Text":"Information Technology : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":378,"Text":"Technical"},{"Id":423,"Text":"ActivityPub"},{"Id":424,"Text":"Fediverse"}],"Speaker":{"Id":127,"DisplayName":"Andy Cowell"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":872,"Title":"ADHD and Me: How neurodivergence serves my testing","Abstract":"Hi there - *wave* - I’m neurodivergent! That means my brain works in, let’s just say…interesting ways…compared to what some people would call baseline or average. Don’t get me started on how weird the idea of NORMAL is…we’ll be here all day.\r\n\r\nBrains are weird, neat, squishy things. Mine has been diagnosed with conditions like ADHD, anxiety, and depression, with a list of common behaviors that go along with it. To some people, this might sound like terrible news. But, I have a different take on my particular collection of mental conditions. To me, they’re my Super Powers!\r\n\r\nWhen looking at the challenges that I face as a software tester, I want to present you with some examples of how neurodivergence can be harnessed to work for me - instead of against me. Come listen to these stories of how these super powers help boost my curiosity, empathy, and effectiveness. You may just learn something about your own brain along the way.\r\n\r\nMy squad who fights for software quality justice:\r\n- ADHD inspires in me a curiosity to dig below the surface \r\n- Anxiety helps me to empathize with user experience\r\n- Depression/manic cycles train me to use my energy wisely, at the right time","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":44,"Text":"Non-Technical : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":28,"Text":"Testing"},{"Id":34,"Text":"Personal Growth"},{"Id":36,"Text":"Life Hacks"},{"Id":50,"Text":"Keynote"},{"Id":73,"Text":"Mental Health"}],"Speaker":{"Id":501,"DisplayName":"Karen Todd"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":959,"Title":"AI for developers: Making your application smarter with Azure Cognitive Services.","Abstract":"Do you want to add AI capabilities to your application but find the prospect of creating your own models overwhelming? Azure Cognitive Services is a great alternative that allows you to bring AI to your application without the extra work. In this talk, we will explore the APIs available and some scenarios they can be applied to; we will then look at a demo application that uses some of these services so you can see how easy it is to integrate them. You will leave this talk confident you can add AI capabilities to your application without having to train a flexible and performant machine learning model.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":45,"Text":"AI : Data Science"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":17,"Text":"Azure"},{"Id":30,"Text":"AI"},{"Id":110,"Text":".Net"}],"Speaker":{"Id":483,"DisplayName":"Samuel Gomez"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":957,"Title":"ARM, Bicep, knees and toes! Infrastructure as code for beginners.","Abstract":"Infrastructure as code allows you to deploy consistent and stable environments in an automated fashion eliminating the need for manual configuration. Tools like ARM, Bicep and Terraform are used to build templates that make these deployments possible, but the syntax of some of them can make it challenging to get started. In this talk, we will explore the differences between these tools and how you can deploy resources using each of them. By the end of this talk you’ll be ready to create your own templates and deploy your resources to the cloud.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":30,"Text":"Information Technology : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":17,"Text":"Azure"},{"Id":137,"Text":"Cloud"}],"Speaker":{"Id":483,"DisplayName":"Samuel Gomez"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":934,"Title":"Building Great Libraries","Abstract":"“Bad libraries build collections; good libraries build services; great libraries build communities.” Whether you are building a class library containing common functionality to use within your company’s products, a class library for your customers to be able to use your services, or the next great open-source project; you should take great care when building a class library so that it is easy to use and widely adopted. During this session, we will talk about coding standards you should apply, documentation, dependencies, publishing, versioning, and handling breaking changes so that you can build class libraries that developers will enjoy using instead of those they curse at.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":35,"Text":"Architecture : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":24,"Text":"Clean Code"},{"Id":41,"Text":"C#"},{"Id":51,"Text":"Best Practicies"},{"Id":54,"Text":"Architecture"},{"Id":56,"Text":"Patterns"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":132,"DisplayName":"Chad Green"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":897,"Title":"Built It, Deliver It, Your Professional Brand","Abstract":"Branding can feel fake, phony, and even disingenuous. The reality is everyone has a brand whether they realize it or not. To use that brand to our benefit we need to be intentional about building it and delivering it. I believe everyone can build a truly authentic brand that communicates who they are. Our brand can make all the difference in how we are perceived and recognized. In this session and with the practical guide, we will cover what you need to know to build your brand and the steps to deliver it.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":44,"Text":"Non-Technical : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":33,"Text":"Career"},{"Id":36,"Text":"Life Hacks"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":492,"DisplayName":"Richard Miller Wimmer"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":918,"Title":"Catching Up With C# Interfaces: What You Know May Be Wrong","Abstract":"C# 8 & C# 11 brought new features to interfaces, including default implementation, access modifiers, and static members. We'll look at these new features, and see where they are useful and where they should be avoided. The world of interfaces has changed; the line between interfaces and abstract classes has blurred; and C# now has multiple inheritance (sort of). With some practical tips, \"gotchas\", and plenty of examples, we'll see how to use these features effectively (and safely) in our code.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":2,"Text":"Languages : .NET"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":41,"Text":"C#"},{"Id":110,"Text":".Net"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":135,"DisplayName":"Jeremy Clark"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":910,"Title":"Collaborative Developer Experience: Working Effectively with Others","Abstract":"How many people do you interact with in your organization? Just a few? Tens? Hundreds? More? Software Engineering involves a lot of people; the days of the lone wolf hacking away are mostly gone.\r\n\r\nSo much revolves around how we all work together in a shared environment, but we rarely think about how our work impacts those around us. There are concrete steps that you can take that won't only improve your development skills, but those around you as well.\r\n\r\nThis talk will break down how we can improve our collaborative skills with technical practices. I'll go through the entire lifecycle of an engineer's interaction with their work, starting from onboarding the very first day to wrapping up features and putting the bow on a mature project. I'll cover codebase etiquette, feedback solicitation, developer communities, post-mortems, and more. Each topic will have guiding advice relevant to junior engineers and senior engineers alike.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":41,"Text":"Non-Technical : Job Advancement"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":9,"Text":"Methodology"},{"Id":51,"Text":"Best Practicies"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":66,"DisplayName":"Pat Viafore"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":906,"Title":"Considerations for Building your First Cloud Data Warehouse","Abstract":"Whether you are looking at migrating from an existing data warehouse or your company is working down the path of building their first, a cloud solution should be a top consideration. The ever-evolving cloud puts limitless analytic capabilities within just a few clicks so that we can focus on building the solutions needed to answer critical business questions. However, it can get really overwhelming with the number of solutions out there so where do you start and how do you figure out what is best for you? In this session, we will look at the top considerations needed to be able to answer that question. We will look at all the major cloud providers, the main solutions they offer, common architectural approaches, and the factors that may influence your decision on each of these. This session will not a technical deep dive, but a guide to help point you the right direction for your next data warehouse. ","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":23,"Text":"Database : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":17,"Text":"Azure"},{"Id":29,"Text":"Database"},{"Id":63,"Text":"AWS"},{"Id":67,"Text":"Python"},{"Id":68,"Text":"Data Science"},{"Id":77,"Text":"Big Data"},{"Id":122,"Text":"google"},{"Id":137,"Text":"Cloud"},{"Id":140,"Text":"spark"},{"Id":378,"Text":"Technical"},{"Id":425,"Text":"Snowflake"},{"Id":426,"Text":"Databricks"},{"Id":427,"Text":"Redshift"},{"Id":428,"Text":"Synapse"},{"Id":429,"Text":"BigQuery"},{"Id":430,"Text":"Lakehouse"},{"Id":431,"Text":"Data Lake"},{"Id":432,"Text":"dbt"},{"Id":433,"Text":"Data Factory"},{"Id":434,"Text":"AWS Glue"}],"Speaker":{"Id":490,"DisplayName":"Dustin Dorsey"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":885,"Title":"Critical Security Mistakes in Frontend Applications","Abstract":"In modern web development, we often forget the importance of Security and rely upon the frameworks we use to keep out attackers, which are getting more and more creative. \r\n\r\nIn this talk, I would talk about the most common vulnerabilities in modern front-end applications and how to combat them.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":24,"Text":"Information Technology : Security"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":12,"Text":"Security"},{"Id":23,"Text":"Web"},{"Id":43,"Text":"FrontEnd"}],"Speaker":{"Id":497,"DisplayName":"Dan Neciu"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":921,"Title":"Cultivating a Culture of Learning and Deliberate Practice","Abstract":"Today’s programmers are constantly sprinting towards deadlines. The typical programmer spends their day in meetings and then it’s back to working on user stories. They never get the time to grow, learn, and reflect because of the constant grind and pressure that is placed on them. Although some companies do offer time for developers to learn on the clock, the sad truth is that most don’t. \r\n\r\nI’m lucky to be on a team that embraces learning. We meet for Learning Hour sessions where we explore technical practices such as refactoring, TDD, clean code, and evolutionary design. Coding together during these sessions have improved our morale and overall effectiveness.\r\n\r\nIn other professions, such as pilots, surgeons, and athletes they all schedule deliberate practice. Practice ensures that our actions during game-time will be second nature. By drilling small techniques and conditioning ourselves, we gain more confidence to face the unknown challenges of working on production code.\r\n\r\nIn my talk, I will go over some strategies developers can use to improve their technical skills like:\r\n\r\n- how to find time to practice using your slack time\r\n- how to create a culture of learning and trust\r\n- how to introduce Learning Hours to your team (Samman Technical Coaching Society)\r\n- how to use ensemble programming as a learning tool","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":41,"Text":"Non-Technical : Job Advancement"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":8,"Text":"Agile"},{"Id":170,"Text":"Learning"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":485,"DisplayName":"Steven Diamante"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":925,"Title":"Deleting Production","Abstract":"How to develop a production environment that in AWS, and can be deleted on the fly. I will cover the core concept of how to develop software to be cloud native, core concepts to follow to make a flexible environment, and most importantly why you should be able delete it with out losing information. This takes chaos engineering to the extreme and prevent you from staying up late at night. \r\n\r\nI plan on showing the practices across software development, operations, and project planning that make this possible. ","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":27,"Text":"Information Technology : AWS"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":63,"Text":"AWS"},{"Id":67,"Text":"Python"},{"Id":84,"Text":"Backend"},{"Id":109,"Text":"Docker"},{"Id":157,"Text":"Infrastructure As Code"}],"Speaker":{"Id":491,"DisplayName":"Matt Vail"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":917,"Title":"Design Patterns: Not Just for Architects","Abstract":"Design patterns are not just for architects. In fact, you already use Design Patterns but probably don't know it. Observer, Facade, Iterator, Proxy - these are all patterns that allow us to better communicate our ideas with other developers. And once we understand the patterns, we can use solutions that people way smarter than us have already implemented. In this session, we'll take a look at several Gang of Four patterns that we regularly use without realizing it. Don't know who the Gang of Four is? Join us to find out.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":35,"Text":"Architecture : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":44,"Text":"Design"},{"Id":56,"Text":"Patterns"}],"Speaker":{"Id":135,"DisplayName":"Jeremy Clark"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":891,"Title":"Design Your APIs First: Creating APIs That Have Longevity","Abstract":"Are you embarking on creating an API for your website or mobile app? If so, just striking forward with your API could be a mistake. In this talk, Shawn Wildermuth will design an API so you can see how REST really works and everything you need to consider before you deploy your first API.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":32,"Text":"Architecture : APIs"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":378,"Text":"Technical"}],"Speaker":{"Id":13,"DisplayName":"Shawn Wildermuth"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":909,"Title":"Finding Frank - A Look at using the Spotify API","Abstract":"APIs are ubiquitous, but they can also be fun! In this talk, we'll take a look at using the Spotify API and Developer Portal to put together a simple app - finding Frank Sinatra's top 5 song. We'll learn about using APIs, how to connect when Authentication is necessary, and what to do with an API payload.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":30,"Text":"Information Technology : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":54,"Text":"Architecture"},{"Id":162,"Text":"Ruby"}],"Speaker":{"Id":484,"DisplayName":"PJ Hagerty"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":929,"Title":"Getting Good (or Better) at Code Reviews","Abstract":"If you write code, you should review code. \r\nThat's it. \r\nThat's the talk. \r\n\r\nThere are quite a few \"reasons\" why developers at various levels find themselves code-review averse: impostor syndrome, time constraints, and area of expertise are a few I've heard. For code owners and project leads, it's a constant battle.\r\n\r\nBut it shouldn't be! It doesn't have to be! \r\n\r\nLet's discuss the benefits of reviewing code, what it is, what it isn't, and how to make it more than the blind rubber stamp approvals we've grown used to. I'll show you my process and things that have helped me cultivate totally awesome code reviewers!","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":39,"Text":"Management : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":25,"Text":"Code Review"},{"Id":378,"Text":"Technical"},{"Id":438,"Text":"Process & Methodologies"}],"Speaker":{"Id":493,"DisplayName":"Rhia Dixon"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":946,"Title":"Getting Started with Graph Databases and Graph Query Languages","Abstract":"Data sets are not getting any smaller.  Dealing with complex queries across highly-connected elements with varying dimensions and types of relationships is non-trivial in traditional systems. In this session, we will look at a new means to store and query highly-connected data via the use of graph data platforms.  We'll cover the basics of using a graph database, the most common graph query languages, and how to apply graph algorithms.  \r\n\r\nGraph computation becoming more common in applications used to detect fraud, cyber security risks, and for better understanding customer interactions.  Attendees of this session will come away with a base knowledge of how graphs can be used in each of these use cases and how they can start applying graph for their organizations.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":23,"Text":"Database : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":29,"Text":"Database"},{"Id":111,"Text":"Open Source"},{"Id":144,"Text":"GraphDB"}],"Speaker":{"Id":480,"DisplayName":"Taylor Riggan"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":947,"Title":"Hacking Your Vacation: Using Data for Fun","Abstract":"Data can be powerful, meaningful, AND fun. Making data-driven decisions can level up your family vacation from awful to awesome. In this session, attendees will walk through a specific example showing how to analyze various data sources to avoid crowds, save money, and piece together a Disney World vacation that's more enjoyable for everyone.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":45,"Text":"AI : Data Science"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":31,"Text":"Machine Learning"},{"Id":68,"Text":"Data Science"}],"Speaker":{"Id":488,"DisplayName":"Becky Gandillon"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":954,"Title":"Health: The Most Important Tech Tool","Abstract":"Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. Based on HR training, research, and personal experience, this session provides realistic suggestions for managing your well-being at work. It covers the connection between physical and mental health, as well as how to discuss these topics with your employer. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, more productive person.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":42,"Text":"Non-Technical : Self-Care"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":73,"Text":"Mental Health"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":162,"DisplayName":"Cassandra Faris"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":956,"Title":"Introduction to SQL Server Machine Learning Services: Let's predict baseball!","Abstract":"Starting several years back, Microsoft began adding machine learning services directly into both the on-premises and Azure managed instance SQL Server products, with additional functionality in each subsequent version. This feature allows for efficient in-database processing of the source data without the need to move it across the network.\r\n\r\nIn this session, we'll take a closer look at ML Services: what it takes to set it up, how it works, what languages are compatible, options available, and the advantages to using in-database processing.\r\n\r\nFinally, we'll apply what we've learned and use SQL ML Services to try and predict major league baseball scores based on historical data.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":48,"Text":"AI : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":31,"Text":"Machine Learning"},{"Id":378,"Text":"Technical"},{"Id":380,"Text":"SQL Server"}],"Speaker":{"Id":498,"DisplayName":"Breanna Hansen"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":922,"Title":"Let's Make Long Methods a Thing of the Past!","Abstract":"Developers write code as a form of communication. The code they write should tell a story and be self-explanatory. Unfortunately, there is a lot of codebases containing long, complex and hard to read methods. Developers spend a significant amount of their time reading code. The easier it is to read than the more time they can focus on delivering business value to customers. \r\n\r\nIn this talk, attendees will learn how to recognize long methods and code paragraphs using the Sparrow Decks technique developed by Llewellyn Falco. Additionally, they will learn about simple refactoring techniques to make the code easier to understand. This session will be highly collaborative and relies heavily on crowd participation.\r\n\r\nAttendees will come away from this session with the ability to\r\n\r\n- identify long methods\r\n- refactor long methods to cleaner code\r\n- improve naming","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":30,"Text":"Information Technology : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":24,"Text":"Clean Code"},{"Id":170,"Text":"Learning"},{"Id":378,"Text":"Technical"},{"Id":436,"Text":"Refactoring"}],"Speaker":{"Id":485,"DisplayName":"Steven Diamante"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":927,"Title":"Machine Learning in Web : Introduction to Tensorflow.JS","Abstract":"This talk gives an introduction about Tensorflow.JS which in an open source Javascript Library that allows running machine learning models on the browser itself and helps integrate the models with web applications. Tensorflow.JS gives creators working with Web Development a powerful tool to use with their web apps to create dynamic web apps using machine learning. It gives these creative professionals a lot of dynamic tools and utilize Machine learning in a really easy way to create powerful and intuitive applications without having much / no knowledge of machine learning before hand.\r\nConventional methods of uploading machine learning models for web applications can be a daunting task for web developers who specialize in Javascript. Learning Python, deployment of models, cross referencing machine learning models made in Python using APIs in Nodejs backend environment are some of the additional requirements for a web developer with little or no experience in Python or Machine Learning. The developers might require powerful CPUs/GPUs to be used for training of the models. This is where Tensorflow.JS ( TFJS ) comes into the picture. It allows standard machine learning libraries and models to be used directly with Javascript. It runs the models on the Browser ( client side ), or on the backend with Nodejs. And it makes it really easy for the Javascript developers to integrate machine learning models without much knowledge behind how these models work.\r\n\r\n","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":1,"Text":"Languages : JavaScript"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":23,"Text":"Web"},{"Id":30,"Text":"AI"},{"Id":31,"Text":"Machine Learning"},{"Id":99,"Text":"javascript"}],"Speaker":{"Id":477,"DisplayName":"Shivay Lamba"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":884,"Title":"Memory First: An Introduction to Redis","Abstract":"Odds are, you’ve heard of Redis. Maybe you’re a total noob and want to learn all about it. Maybe you’ve used it to cache an API call or some JSON strings and want to know what else it can do. Maybe you *haven’t* heard of Redis and are curious what all the fuss is about.\r\n\r\nWanna find out? Join me as I explain what Redis is—a wicked-fast, memory-first database—and why you should care. I’ll share with you what it can store, how you can access it, and how you can make sure that what’s in memory is still there when the power goes off. We’ll explore how you can extend Redis—adding new commands, new data structures, and new capabilities. And, we’ll do it both from the command line and from code with examples in C#, Java, JavaScript, and Python.\r\n\r\nWhen we’re done, you’ll know what Redis is and what all the fuss was about. But, more importantly, you’ll know how to put memory first to build fast applications and faster experiences.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":23,"Text":"Database : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":29,"Text":"Database"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":389,"DisplayName":"Guy Royse"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":907,"Title":"Modernizing Data Transformations with dbt","Abstract":"dbt is a free and easy to use data transformation tool that is exploding in popularity, transforming the landscape of data and analytics platforms across the world. The transformation (T) step in your extract-load-transform (ELT) process can often be seen a bottleneck, requiring specialized skills, rigorous testing and an extensive deployment process to handle even minor changes. dbt focuses on the transformation step, making it super easy to transform data already in your database or data warehouse. No specialized skills required; all you need with dbt is to write a Select statement. In other words, dbt takes the SQL skills that data analysts and engineers are already comfortable with and enables them to build their own analytics engineering workflows. This session is intended for anyone new to dbt who wants to know if it is right fit for their organization. We will cover the dbt viewpoint, the fundamental uses of the tool, and demo several features so that you can get started right away creating automated analytics engineering workflows.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":23,"Text":"Database : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":17,"Text":"Azure"},{"Id":29,"Text":"Database"},{"Id":63,"Text":"AWS"},{"Id":68,"Text":"Data Science"},{"Id":77,"Text":"Big Data"},{"Id":122,"Text":"google"},{"Id":378,"Text":"Technical"},{"Id":425,"Text":"Snowflake"},{"Id":426,"Text":"Databricks"},{"Id":427,"Text":"Redshift"},{"Id":428,"Text":"Synapse"},{"Id":429,"Text":"BigQuery"},{"Id":430,"Text":"Lakehouse"},{"Id":431,"Text":"Data Lake"},{"Id":432,"Text":"dbt"},{"Id":433,"Text":"Data Factory"},{"Id":434,"Text":"AWS Glue"}],"Speaker":{"Id":490,"DisplayName":"Dustin Dorsey"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":951,"Title":"Neurodiversity and Productivity – A Survival Guide","Abstract":"We live in a world where it’s easy to be overstimulated and distracted. The more virtual our world becomes, the harder it is to focus, communicate, and complete tasks. This is especially challenging for people with neurodiversities such as ADHD, Autism, and Dyslexia, and those that support them. The tech industry has a higher than average neurodiverse population, creating a unique set of time management and communication challenges. In this session, you’ll learn what it means to be neurodiverse and how it affects people at work. Based on scientific research and firsthand experience, we’ll discuss methods for maximizing productivity and focus. You’ll also learn how to communicate more effectively when everything feels overwhelming so you can get the support you need. While the focus is on neurodiversity, this session is designed for anyone who needs help navigating our increasingly distracting world. By the time you leave, you’ll have tools and techniques you can use to be more productive and less stressed - yes, that’s possible!","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":44,"Text":"Non-Technical : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":36,"Text":"Life Hacks"},{"Id":73,"Text":"Mental Health"},{"Id":107,"Text":"Community"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":162,"DisplayName":"Cassandra Faris"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":949,"Title":"Quiet Managing: The Antidote to Quiet Quitting","Abstract":"2022 was the year of \"quiet quitting\". Or was it? In this session we'll talk about quiet quitting and why it's likely just symptoms of underlying mismatched expectations between managers and developers. Then we'll go over some strategies for managing successful technical teams and employees. This \"quiet managing\" includes setting up your people for success, getting out of their way, and letting them deliver. Trust, autonomy and empathy are key!","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":39,"Text":"Management : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":35,"Text":"Leadership"},{"Id":164,"Text":"Emotional Intelligence"},{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":488,"DisplayName":"Becky Gandillon"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":923,"Title":"SIGN-TO-TEXT:Unleashing the Power of Google AI for real time ASL transcription","Abstract":"Communication barriers between the deaf and hard-of-hearing community and the wider world have created significant challenges in effective interaction.However the good news is cutting-edge AI technologies can revolutionize the way we transcribe American Sign Language (ASL) and enable inclusive communication.\r\n\r\nUsing the power of Python libraries and Google's AI tools, including the Google Cloud Vision API for hand and finger tracking, TensorFlow for deep learning models, and AutoML for data scarcity challenges, I will demonstrate Sign_To_Text, a revolutionary system that transforms how sign language users connect with the world. \r\n\r\nWitness live demonstrations as I seamlessly integrate Google AI technologies to translate fingerspelled letters in real time  into textual representations, empowering individuals and fostering inclusive communication.\r\n","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":3,"Text":"Advanced"},"Category":{"Id":48,"Text":"AI : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":31,"Text":"Machine Learning"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":496,"DisplayName":"Atieno Ouma"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":920,"Title":"SQL Server Game Show - Developer Edition: Part II","Abstract":"At DevSpace 2018, I presented a fun and informational session built around a set of questions related to SQL Server development. Based on the highly-positive feedback from that session, this year I present an all-new series of questions. Test your knowledge of SQL Server development (both on-prem and Azure) and compete against your fellow attendees! In the process, we'll pause and discuss how to write better queries that perform and design better systems. Who says learning can't be fun?","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":21,"Text":"Database : SQL"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":29,"Text":"Database"},{"Id":378,"Text":"Technical"},{"Id":380,"Text":"SQL Server"}],"Speaker":{"Id":498,"DisplayName":"Breanna Hansen"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":887,"Title":"The Bare Minimum: Accessibility In Web","Abstract":"More and more people are using the web every day, and we have to do at least, AT LEAST, the bare minimum to make sure everyone can use our websites. In this talk, I will explain what and how we should be required to implement. ","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":18,"Text":"Design : Web"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":43,"Text":"FrontEnd"},{"Id":75,"Text":"Accessibility"},{"Id":99,"Text":"javascript"}],"Speaker":{"Id":497,"DisplayName":"Dan Neciu"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":937,"Title":"Time Travelling Data: A Quick Overview of SQL Server Temporal Tables","Abstract":"Often customers will ask what the data looked like on a particular date and you might have built completed triggers and procedures to track that history.  But SQL Server and Azure SQL already have a solution built-in, and it's straightforward to use.  During this quick overview, you will understand what Temporal Tables are, the key scenarios around their use, and how to use built-in query syntax to retrieve the values of database records at a point in time.  We will also look at how Entity Framework Core makes this even easier now with Temporal Table support.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":21,"Text":"Database : SQL"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":29,"Text":"Database"},{"Id":378,"Text":"Technical"},{"Id":380,"Text":"SQL Server"}],"Speaker":{"Id":132,"DisplayName":"Chad Green"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":881,"Title":"Tracking Aircraft with Streams + Software-Defined Radio","Abstract":"Aircraft are everywhere. Knowing exactly where is paramount as it’s considered bad form for two aircraft to be in the same place at the same time. To avoid this, aircraft worldwide constantly and publicly broadcast their location, heading, and all sorts of other data using a system called ADS-B or Automatic Dependent Surveillance Broadcast.\r\n\r\nThis data is a natural fit for an event stream. After all, it’s a constant stream of data that is literally being broadcast in real-time. But how can we capture these broadcasts and the data within? Surely it must require expensive hardware and special tools!\r\n\r\nNot so much. It turns out that we can capture ADS-B data easily using a combination of a cheap radio dongle and free software—a combination called software-defined radio. From there we can store it in an event stream and consume, transform, and publish it at our leisure. Cool, right?\r\n\r\nIn this session, you’ll learn how software-defined radio works (and not just for ADB-S), how to receive and store ADS-B data in event streams, and how to use those streams to build a map showing real-time flight data using Node.js, Redis Streams, and whatever front-end JavaScript framework happens to be popular that day!","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":1,"Text":"Languages : JavaScript"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":20,"Text":"IoT"},{"Id":29,"Text":"Database"},{"Id":99,"Text":"javascript"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":389,"DisplayName":"Guy Royse"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":955,"Title":"Unleashing Your Interview Potential: Strategies for Developers to Excel in the Hiring Process","Abstract":"Sharai shares valuable tips for developers to increase confidence and excel in job interviews. Learn how to recognize your value, prepare effectively, showcase projects, master technical and behavioral interviews, embrace a growth mindset, and prioritize self-care. Join Sharai to gain the confidence needed to stand out and succeed in your job interviews. Boost your career prospects with practical insights and strategies.","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":40,"Text":"Non-Technical : Job Placement"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":179,"Text":"Education"},{"Id":379,"Text":"Non-Technical"},{"Id":442,"Text":"Interviewing, professional development"}],"Speaker":{"Id":489,"DisplayName":"Sharai Johnson"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":889,"Title":"Vue and TailwindCSS - A Great Combination or the Greatest Combination?","Abstract":"While TailwindCSS is knows as a popular CSS utility class tool, using it in Vue can really accellerate your development. In this talk, Shawn Wildermuth will add TailwindCSS to a Vue project and show you how to use it inside of your Single File Components","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":18,"Text":"Design : Web"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":172,"Text":"VueJS"}],"Speaker":{"Id":13,"DisplayName":"Shawn Wildermuth"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":926,"Title":"WebAssembly beyond the browser","Abstract":"The talk covers the humble beginning of WebAssembly in the Web, to make itself one of the versatile technologies, now being used in the web, the edge, and of course the server side.\r\n\r\nThe talk covers the current landscape of WebAssembly in the server side world including Nodejs and Deno, and also on the edge run times and serverless functions. \r\nThe audience will benefit from learning about the various areas where web assembly has revolutionized the Backend and serverless Javascript ecosystem. ","Room":null,"SessionLength":30,"EventId":2023,"Level":{"Id":1,"Text":"Beginner"},"Category":{"Id":16,"Text":"Languages : Other"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":23,"Text":"Web"},{"Id":137,"Text":"Cloud"},{"Id":149,"Text":"Serverless"},{"Id":374,"Text":"WebAssembly"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":477,"DisplayName":"Shivay Lamba"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":908,"Title":"What do Rust developers mean by “zero-cost abstractions”?","Abstract":"The concept of “zero-cost abstractions” lies at the core of the Rust programming language, enabling developers to write expressive, safe, and highly performant code. In this session, we will delve into the fundamental principles that underpin zero-cost abstractions and explore how Rust achieves a remarkable balance between abstraction and performance through its ownership model and advanced type system.\r\n\r\nThrough the analysis of real-world examples, we will dissect common patterns and idioms employed by Rust developers to harness the power of zero-cost abstractions effectively. By examining these practical use cases, attendees will gain a comprehensive understanding of the trade-offs and techniques involved in leveraging the Rust type system to generate efficient code.\r\n\r\nFurthermore, this talk will address misconceptions and common pitfalls related to zero-cost abstractions, shedding light on potential performance bottlenecks and providing strategies for optimizing code where necessary. By the end of the session, attendees will have a clear understanding of what Rust developers truly mean by “zero-cost abstractions” and how to leverage this powerful concept to write efficient and maintainable code in their own projects.\r\n\r\nJoin us for an enlightening exploration into the core principles of Rust and unleash the full potential of zero-cost abstractions in your development journey.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":14,"Text":"Languages : Rust"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":46,"Text":"Performance"},{"Id":56,"Text":"Patterns"},{"Id":96,"Text":"Rust"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":22,"DisplayName":"Jonathan Creekmore"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":898,"Title":"What is the AWS Cloud Development Kit?","Abstract":"The AWS Cloud Development Kit (AWS CDK) is an open source project that allows you to create your infrastructure in a major programming language of your choice, such as Python, Java, Javascript, or C#/.Net.  This allows you to build and use high level constructs of infrastructure with sensible defaults, package it in reusable modules, and track versions of your architecture as it changes.  A single line of code can deploy extremely complex infrastructure changes that have already been reviewed and approved.  Come learn the basics of AWS CDK!","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":27,"Text":"Information Technology : AWS"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":13,"Text":"DevOps"},{"Id":41,"Text":"C#"},{"Id":45,"Text":"Animation"},{"Id":54,"Text":"Architecture"},{"Id":56,"Text":"Patterns"},{"Id":63,"Text":"AWS"},{"Id":67,"Text":"Python"},{"Id":100,"Text":"typescript"},{"Id":110,"Text":".Net"},{"Id":157,"Text":"Infrastructure As Code"},{"Id":378,"Text":"Technical"}],"Speaker":{"Id":127,"DisplayName":"Andy Cowell"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}},{"Id":873,"Title":"You're Not Alone","Abstract":"Growing throughout your career can be daunting. Lots of times people feel like they are alone in their struggles but at the end of the day, everyone deals with the same shit. This keynote talk is an encouraging word for folks to get out there and be fearless and take their career and lives by their own hands and lean on others to get to where they want to go.","Room":null,"SessionLength":60,"EventId":2023,"Level":{"Id":2,"Text":"Intermediate"},"Category":{"Id":40,"Text":"Non-Technical : Job Placement"},"RoomId":null,"TimeSlotId":null,"Tags":[{"Id":379,"Text":"Non-Technical"}],"Speaker":{"Id":130,"DisplayName":"Taylor Desseyn"},"TimeSlot":{"StartTime":null,"EndTime":null,"DisplayDateTime":"Sunday, August 27 at 2:10 PM"}}]